{"Place of Birth":"Vill. Kondairu,Mahaboobnagar (Andhra Pradesh)","Sports and Clubs":"Cricket and kabaddi","Social And Cultural Activities":"Social service; organising social functions, free health camps for the poor in rural and urban areas","No.of Daughters":"1","Mother's Name":"Late Smt. M. Savaramma","Party Name":"Indian National Congress(INC)","Profession":"Medical Practitioner Social Worker","Date of Marriage":"12 Nov 1986","Favourite Pastime and Recreation":"Reading, music and spending time with family","Constituency":"Nagarkurnool (SC) (Andhra Pradesh )","Special Interests":"Social service","Date of Birth":"22 May 1951","Educational Qualifications":"M.B.B.S., D.L.O., M.S. (E.N.T.) Educated at Osmania Medical College, Hyderabad,Andhra Pradesh","No. of Sons":"2","Other Information":", Vigilance & Monitoring Committee on Rual Development, Mahaboob Nagar; : (i) Andhra Pradesh SC\/ST Gazetted Officers Welfare Association, 1994-96; (ii) A.P. Arundatheeya Bandhu Seva Mandali; (iii) HMT Workers Union, 1996-2000; (iv) Pragatools Limited (PTL) Workers and Employees Union;(v) Doctor for Parliamentarian Forum; Honarary President- All India Postal Sc\/ST Employees Welfare Association; Post-Graduates Association, Osmania Medical College; (i) Sree S.A.P College, Vikarabad Ranga Reddy; (ii) Hyderabad E.N.T. Surgeons Association; and (iii) A.P. Adijambava Arundatheeya Federation; Southern States Adijambava Arundatheeya Federation; (i) Mointering Committee on Chief Whips and Whips Recommendations; (ii) Court, University of Hyderabad; (iii) Advisory Committee to Andhra Pradesh SC\/ST Welfare Association, 1993-96; and (iv) Indo-China Parliamentary Committee; Attended as a delegate to the meeting of Telugu Association of North America-USA","Present Address":"\n9, Ferozeshah Road,\nNew Delhi - 110 001\nTels. (011) 23782769, 9013180050 (M), 9440297979 (M)\n\n\n\n","Email Address :":"jagannath.m@sansad.nic.in","Name":"Jagannath,Dr. M.","Marital Status":"Married","Countries Visited":"Widely travelled; Member Indian Parliamentary Delegation to Australia, Bangkok, Bangladesh, Canada, China, Cuba, Dubai, France,Hongkong, Iran, New Zealand, Singapore, Spain and U.K; represented India in the International Conference on Racism, South Africa; Member, Indo-China Parliamentary Committee, Malaysia","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/156.jpg","Positions Held":"\n1996\nElected to 11th Lok Sabha\n\n1996-97\nLeader, Telugu Desam Parliamentary Party, Lok Sabha\nConvenor, Committee on the Welfare of Scheduled Castes and Scheduled Tribes\nMember, Joint Parliamentary Committee on Women’s Reservation\nMember, Committee on Human Resource Development\nMember, Consultative Committee, Ministry of Railways\n\n1999\nRe-elected to 13th Lok Sabha (2nd term)\nGeneral Secretary, SC\/ST, Parliamentary Forum\nJoint Convenor on Chief Whips and Whips Committee, Monitoring Group-A\nMember, Consultative Committee, Ministry of Health and Family Welfare Member, Committee on Commerce\nMember, Committee on Human Resource Development\n\n2000-2004\nMember, Consultative Committee, Ministry of Health and Family Welfare Member, Committee on Human Resource Development\nMember, Committee on Subordinate Legislation\n\n2004\nRe-elected to 14th Lok Sabha( 3rd term)\nMember, Committee on Petitions\nMember, Public Accounts Committee\nMember, Committee on Water Resources\nCo-Chairman, Scheduled Castes and Scheduled Tribes Parliamentary Forum\n\n5 Aug. 2007-15 Dec. 2008\nMember, Committee on Petroleum and Natural Gas\n\n2009\nRe-elected to 15th Lok Sabha (4th term)\n\n31 Aug. 2009\nMember, Committee on Social Justice and Empowerment\n\n23 Sept. 2009\nMember, Committee of Privileges\nMember, Consultative Committee on Helath and Family Welfare\n","Permanent Address":"\nH. No. 17-1-382\/V\/2\/11, Vaishali Nagar Colony, Champapet,\nHyderabad - 500 079, Andhra Pradesh\nTels. (040) 24078990, 24075280, 24078881\n\n\n\n","Father's Name":"Late Shri M. Pullaiah","Spouse's Name":"Smt. M. Savthri"}