{"Place of Birth":"Kankhal, Distt. Haridwar (Uttar Pradesh)","Sports and Clubs":"Badminton; member of Constitution Club of India","Social And Cultural Activities":"Played an outstanding role in the formation of Uttarakhand State; one of the patrons of Uttarakhand Sanyunkta Sangharsh Samiti; notable contribution in protecting and preserving the ancient cultural heritage and in providing assistance to students, sportspersons and women; relief to the victims of natural calamities-floods, earthquakes, droughts and hailstorms etc. in various parts of the country; propagated national unity, integrity and religious harmony by organising conferences all over the country; organised Sadhbhawana padyatra in Gujrat post-Godhra riots, November 2002; organised several padyatras from Badrinath to Delhi, Siliguri to Gangtok and Gaya to Patna to interact and promote patriotism and spread the message of secular ideals; convened several hundred Sadhbhawana Sammelans in the last 25 years in various parts of the country to disseminate the feeling of goodwill and tolerance amongst different religious communities; organised and understood Gandhi yatra on the 125th Birth Anniversary Celebration as convenor; and was honoured by the President of Nepal, Shri Ram Baran Yadav in Ocotober for convening Pashupati Sangeet Mahotsav","Mother's Name":"Late Smt.Rajeshwari Devi","Party Name":"Indian National Congress(INC)","Profession":"Social Worker Agriculturist","Date of Marriage":"08 Feb 1981","Favourite Pastime and Recreation":"Keeping abreast current affairs, international events, latest scientific developments, technology and its applications and travelling, meeting and interacting with varied groups of people","Literary Artistic & Scientific Accomplishments":"Encouraging writers, poets, historians and others who are active in the field of fine arts for the advancement of the culture and folk arts of Uttarakhand; organised study groups and National Integration Camps; organized Gandhi Rainbow Peace March at Pietermaritzburg in South Africa, June, 2005 and presented a statue of Mahatama Gandhi as Barrister to the Mayor at the Civic Reception at the City Hall, Pitermaritzburg","Constituency":"Garhwal (Uttarakhand )","Special Interests":"Extending the latest computer technology, desk top printing and latest scientific advancements to the masses and eradication of superstitions, untouchability and other social evils; and comparative study of religions, cultures and history","Date of Birth":"21 Sep 1951","Educational Qualifications":"Senior Cambridge Educated at St. George`s College, Mussoorie, Uttarakhand","No. of Sons":"2","Present Address":"\n28, Mahadev Road,\nNew Delhi - 110 001\nTels. (011) 23326623, 9013180355 (M) Fax. (011) 23326624\n\n\n\n","Email Address :":"(i) rajhans1@sancharnet.in (ii) eureka@del3.vsnl.net.in","Name":"Maharaj,Shri Satpal","Marital Status":"Married","Countries Visited":"Widely travelled","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/3717.jpg","Positions Held":"\nMarch 1991-Sept. 1994\nMember, Executive Committee, P.C.C.(I),Uttar Pradesh\n\nJan. 1992-1994\nMember, Rashtriya Rahat and Sadhbhawana Samiti (National Relief and Goodwill Committee)\n\nMarch 1992-Oct. 1994\nMember, A.I.C.C.(I)\n\nMar. 1993-Oct. 1994\nMember, Rajya Ekikaran Parishad, UP (State Integration Council)\n\nFeb. 1994-Feb. 1995\nConvener, Mahatma Gandhi 125th Anniversary Celebration Committee, Uttar Pradesh\n\nApr. 1994-Mar. 1996\nPatron, Uttarakhand Sanyukata Sangharsh Samiti\n\nOct. 1995-Dec. 1995\nVice-President, All India Indira Congress Committee (Tiwari), Uttar Pradesh\n\nJan. 1996-Dec. 1996\nPresident, Indira Congress (Tiwari), Uttarakhand\n\n1996\nElected to 11th Lok Sabha\n\nJuly 1996-June 97\nUnion Minister of State, Railways\n\nJune 1997-Mar. 1998\nUnion Minister of State, Finance\n\n1997-1998\nMember, Implementation Committee for Commemoration of 50th Anniversary of India`s Independence\n\n2000 onwards\nMember, AICC, Uttarakhand\n\nAug. 2001\nPresident, Human Rights Department, Uttarakhand Pradesh Congress Committee\n\nFeb.8, 2002-2004\nSecretary, All India Congress Committee\n\nFeb. 2003-Mar. 2007\nVice-Chairman, 20-Point Programme Implementation Dept. Govt. of Uttarakhand (Cabinet Rank)\n\nApr. 2008\nAICC Co-ordinator to Madhya Pradesh and Chhattisgarh\n\n2009\nRe-elected to 15th Lok Sabha (2nd term)\n\n31 Aug. 2009\nChairman, Standing Committee on Defence\n\n16 Sep. 2009\nMember, Consultative Committee for the Ministry of Railways\n\n19 Oct. 2010\nMember, General Purposes Committee\n\n5 May 2010\nMember, Committee on Public Accounts\n","Permanent Address":"\n13, Municipal Road,\nDehradun, Uttarakhand\nTel. (0135) 2652414, 2714546\n\n\n\n","Father's Name":"Late Shri Hansji Maharaj","Spouse's Name":"Smt. Amrita Rawat"}