{"Place of Birth":"Jullundur (Punjab)","Sports and Clubs":"Member, (i) Belvedere Club, The Oberoi Hotel, New Delhi; (ii) India International Club, New Delhi; and (iii) India Habitat Centre, New Delhi","Social And Cultural Activities":"Member of the Working Group on Arbitrary Detentions set up by the Human Rights Commission in Geneva; Investigated cases of arbitrary detentions throughout the world; analyzed detention and detention laws in the context of the Universal Declaration of Human Rights and the Covenant for Civil and Political Rights and advised the Government to release individuals from detention if such detention was not in accordance with the above mentioned international instruments; actively involved in the protection of our national heritage and in particular, archeological sites which have immense historical and cultural significance.","Mother's Name":"Smt. Kailash Rani Sibal","Party Name":"Indian National Congress(INC)","Profession":"Advocate","Date of Marriage":"13 Apr 1973","Favourite Pastime and Recreation":"Reading, writing, travelling and cooking; actively interested in spreading scientific knowledge and reasoning","Literary Artistic & Scientific Accomplishments":"Contributed articles on important issues such as security, nuclear proliferation, terrorism etc., in national dailies and periodicals","Constituency":"Chandni Chowk (Delhi )","Special Interests":"Particularly interested in education; member, governing body of the St. Stephen`s College and served on the Board of the Indira Gandhi National Open University for several years; enjoys going to educational institutions and interacting with students; believes that education should be far removed from politics; appointed Chairman of a Committee by the Ministry of Human Resource Development to ensure free access to education to children between the ages of 6-14 and suggest measures for the implementation of the constitutional mandate in this respect","Date of Birth":"08 Aug 1948","Educational Qualifications":"M.A. (History), LL. M. Educated at St. Stephen`s College, University of Delhi, Delhi and Harward Law School, USA","No. of Sons":"2","Other Information":"President, Supreme Court Bar Association, 1995-96, 1997-98 and 2001-2002; Co-Chairman, Indo-US Parliamentary Forum, 2002; studied and worked in the United States; offered appointment to the I.A.S., but declined; joined the Bar in 1972; designated Senior Advocate in 1983; leader, Indian delegation to the Human Rights Commission, Geneva, January, 1991; Member,(i) Press Council of India March 2001, (ii) Executive Council, Institute of Constitutional and Parliamentary Studies, July 2001; (iii) Board of International AIDS Vaccine Initiative, headquartered in U.S., 2002; (iv) Programme Board of the Bill and Melinda Gates Foundation`s India AIDS Initiative, 2003; (v) working group on Arbitrary Detention set up by the Human Rights Commission, Geneva; (vi) Board of Management, Indira Gandhi National Open University, 1993; (vii) Governing Body, St. Stephen`s College, University of Delhi, 1993; (viii) Indian Parliamentary delegation which visited South Africa, Nigeria and Senegal to advocate against Pakistan`s involvement in corss-border terrorism, 2002; addressed Parliament of India in the historic impeachment proceedings against Justic V. Ramaswamy, then a sitting judge of the Supreme Court of India; as a nominee of the Working Group set up by the Human Rights Commission to visit Bhutan and Vietnam to assess and report on the human rights situation prevailing there in 1994; as the Chairman of the Working Group set up by the Human Rights Commission for dealing with arbitrary detentions, visited China in October 1997 to look into the alleged human rights violation there; convenor, International Policy Makers Conference of HIV\/AIDS, New Delhi, 2002; participated in the International Workshop on ``Peaceful Nuclear Use and the Future of Non-Proliferation: Coping with the diversion of Nuclear Mateirals and Nuclear Terrorism`` organized by Japan Atomic Industrial Forum, at Tokyo, Japan, 2002; appeared in a number of landmark cases in the field of Constitutional Law, Commercial Law and Criminal Law; specialist in the field of Constitutional Law; was official spokesman of the Indian National Congress preceding the General Elections in 1999 and 2004; awarded the Jawaharlal Nehru Birth Centenary Award, 2004-2005 awarded by the Indian Science Congress Association duing the 92nd Indian Science Congress held at Ahmedabad, January 2005; represented India in the Annual Meeting of World Economic Forum, 2005 at Davos, Switzerland, January 2005; led the Indian delegation to visit Antaractica, February 2005; led the CII Roadshow held at Seattle and San Francisco, U.S.A., April 2005","Present Address":"\n19, Teen Murti Marg,\nNew Delhi - 110 011\nTels. (011) 23739191 (IT), 23724320 (O) 23019420, 23019421 (R) Fax (011) 23710445 (O) 23018705 (R)\nParliament Address: Room No. 69-A&D, Parliament House,\nNew Delhi - 110001\nTel. (011) 23014556\n","Email Address :":"kapilsibal@hotmail.com","Name":"Sibal,Shri Kapil","Marital Status":"Widower","Countries Visited":"Widely travelled","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4077.jpg","Positions Held":"\nDec.1989 - Dec.1990\nAdditional Solicitor General of India\n\n1998-2004\nMember, Rajya Sabha\n\n2000-2002\nSecretary, Congress Parliamentary Party\n\nApr. 2001-Dec. 2002\nMember,Joint Parliamentary Committe (J.P.C.) on Stock Market Scam\n\nAug. 2001\nMember, Business Advisory Committee\n\n2002\nMember, Committee on Home Affairs\n\n2004\nElected to 14th Lok Sabha\n\n23 May 2004 - May 2009\nUnion Cabinet Minister, Science & Technology and Earth Sciences\n\n--\nVice President, Parliamentary Forum on Water Conservation & Management\n\n2009\nRe-elected to 15th Lok Sabha (2nd term)\n\n31 May 2009 - 28 Oct. 2012\nUnion Cabinet Minister, Human Resource Development\n\n19. Jan. 2011 onwards\nUnion Cabinet Minister, Communications and Information Technology\n\n11 May 2013 onwards\nUnion Cabinet Minister, Law and Justice (Additional Charge)\n","Permanent Address":"\nC-1, Maharani Bagh,\nNew Delhi - 110 065\nTel. (011) 26830452\n\n\n\n","Father's Name":"Shri Hira Lal Sibal","Spouse's Name":"Late Smt. Nina Sibal"}