{"Place of Birth":"Rohtak (Haryana)","Sports and Clubs":"Cricket, Haryana style wrestiling and tennis","Social And Cultural Activities":"Active participant in various Congress events and functions as a student and after; participated in all the election campaigns in Rohtak Lok Sabha and Kiloi Vidhan Sabha constituences during the last 15 years on behalf of Congress Party as a student, a party propagandist, a party leader and organiser","Mother's Name":"Smt. Asha Hooda","Party Name":"Indian National Congress(INC)","Profession":"Political and Social Worker","Constituency":"Rohtak (Haryana )","Special Interests":"Greatly interested in agriculture; rural based infrastructure, education and energy projects; avid reader on subjects of History, Economics and Politics with keen interest in topics ranging from American Civil War, Indian Freedom movement, World War II, French Revolution, ancient Egypt, Greeks and the Indus valley civilization to social economics, Marxism, capitalistic economic models, polity and governance","Date of Birth":"04 Jan 1978","Educational Qualifications":"B.Tech., M.B.A. Educated at University at Birla Institute, M.D. University, Rohtak (Haryana) and Kelley School of Business, Indiana University, Bloomington, USA","Other Information":"Member, Council of Indian Institutes of Technology (IITs); Elected Vice Chiarman, Indian Red Cross Society; Chairperson, Indo-UK forum of Parliamentarians; President, Haryana State Football Association;Patron, Sarvhitkari Seva Tgrust (NGO working on education, health and water);Participant in Aspen Strategy Group dialogue on Indo-US relations;Awarded honorary \"Beta Gamma Sigma\" (top 1% of class) at Indiana university; elected President of Asian Students Association at Indiana University in a unanimous vote; successfully led initative for holding `Asian Business Conference` at Harvard Business School; as Social Secretary, 1998-1999 ogranised all major social events and cultural functions during the period; Worked experience with (i) Reliance Industries Ltd., India, May 1999-December 2000; (ii) Software Engineer, Infosys Technologies Ltd., India, December 2000-August 2001; and (iii) American Airlines\/Sabre Holdings, Dallas, USA\/Travelocity June 2003-July 2005; Participant in grassroots election campaigns in Haryana State during the last 15 years on behalf of Indian National congress as student, a party progagandist, organiser and a party cantidate;his fatherSh. B.S. Hooda is currently the chief Minister of Haryana;he has been a Member of parliaemnt for five terms;his grandfather, Sh. Ranbir Singh was the last surviving member of the Consitutent Assembly of India (the founding fathers);apart from ebing a renowned freedom fither, Sh. Ranbir Singh Ji had been a member of provisional Parliament, Lok Sabha, rajya Sabha, Punjab and Haryana State Legislative Assemblies;and his great grandfather, Sh. Matu ram was pioneer of Arya Samaj, Indian Naitonal Congress and Freedom Movement in erstwhile Punjab State","Present Address":"\n9, Pandit Pant Marg,\nNew Delhi - 110 001\nTels. (011) 23737019, 09818368168 (M)\n\n\n\n","Email Address :":"office@deepender.in","Name":"Hooda,Shri Deepender Singh","Marital Status":"Married","Countries Visited":"Australia, Germany, Indonesia, Japan, Kenya,Sweden and USA","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4207.jpg","Positions Held":"\nOctober 2005\nElected to 14th Lok Sabha\nMember, Consultative Committee on External Affairs\n\n5 Aug. 2007\nMember, Committee on Agriculture\n\n2009\nRe-elected to 15th Lok Sabha (2nd term)\n\n31 Aug. 2009\nMember, Committee on Human Resource Development\n\n7th Oct. 2009\nMember, Committee on Members of Parliament Local Area Development Scheme\n","Permanent Address":"\nVill. & P.O., Sanghi,\nTeh. & Distt. Rohtak Haryana\n\n\n\n\n","Father's Name":"Shri Bhupinder Singh Hooda","Spouse's Name":"Smt. Sweta Mirdha Hooda"}