{"Place of Birth":"Bareilly (Uttar Pradesh)","Sports and Clubs":"Member, (i) Rotary Club (Bareilly); (ii) Bareilly Club (Bareilly); swimming and other games","Social And Cultural Activities":"Worked for socio-economic upliftment and cultural well being of fellow Indians especially from weaker sections including SC\/ST and minorities ; involved in blood donation camps, charity shows, opening up libraries,women empowerment centers, youth leadership and character building camps; organised numerous debates\/seminars to promote national intergration, job oriented vocational training, pulse polio, etc.","No.of Daughters":"2","Mother's Name":"Smt. Swaraj Shuchi Aron","Party Name":"Indian National Congress(INC)","Profession":"Advocate","Date of Marriage":"09 Jun 1983","Favourite Pastime and Recreation":"Travelling and tourism, music, swimming, interaction with a core sections of society, organising or attending cultural musical events","Literary Artistic & Scientific Accomplishments":"Participated in many cultural programmes apart from dance and drama troupe in school and college days. Associated as patron and office bearer of organisations which promote such activities. Some of them are Bareilly Cultural Association; Jawaharlal Nehru National Youth Centre; Noida Odissi Manch etc.","Constituency":"Bareilly (Uttar Pradesh )","Special Interests":"Promotion of social and political work oriented programmes\/courses for the youth; implementing programmes for the betterment of rural and urban areas","Date of Birth":"08 May 1959","Educational Qualifications":"B.A., LL.B. Educated at Rohilkhand University, Bareilly, Uttar Pradesh","Other Information":"Strongly believes in `Vasudhaiva Kutumbakam`; respect for all cultures, faiths and religions; advocate of effective, ethical and secular governances. Keen interest to work for an ideal India free from corruption, crime, illiteracy, unemployment and exploitation of the havenots; advocate of rule of law, modernity while preserving the nation`s culture, diversity, plurality; to endeavour to work towards eradication of bias, discrimination and exploitation of developing, under developed and third world nations and\/or people by the elite from all over the world; Press Club of India (New Delhi);","Present Address":"\n(i) B-236, Sector-50,\nNoida, Uttar Pradesh\nTels. (0120) 4270564, (011) 26282843 9013180308 (M) Fax. (011) 26239530\n\n\n\n","Email Address :":"1. aron.praveen@gmail.com 2. praveen.aron@sansad.nic.in","Name":"Aron,Shri Praveen Singh.","Marital Status":"Married","Countries Visited":"Canada, Croatia, Denmark,France, Finland, Germany, Italy, Japan, Luxemburg, Malaysia, Norway, Poland, Spain, South Africa, South Korea, Sweden, U.A.E., U.K and U.S.A.","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4276.jpg","Positions Held":"\n1989-91\nMember, Uttar Pradesh Legislative Assembly\n\n1993-95\nMember, Uttar Pradesh Legislative Assembly (second term)\nMinister of State, Science and Information Technology, Government of Uttar Pradesh\n\n1995\nMinister of State, Health and Family Welfare, Government of Uttar Pradesh\n\n2009\nElected to 15th Lok Sabha\n\n31 Aug. 2009\nMember, Committee on Urban Development\n\n23 Sep. 2009\nMember, Committee on Private Members` Bills and Resolutions\n\n1 May 2013\nMember, Committee on Public Undertakings\n","Permanent Address":"\n297, Salvation Army Road\nBareilly, Uttar Pradesh\nTels. (0581) 2420035, 09412761188 (M) Fax. (0581) 2567088\n\n\n\n","Father's Name":"Late Dr. P.C. Aron","Spouse's Name":"Smt. Supriya Aron"}