{"Place of Birth":"Vill.Khera Shilajit, Hamirpur (Uttar Pradesh)","Sports and Clubs":"Wrestling, kabbadi, volleyball and daily exercise","Social And Cultural Activities":"State President, Kosi Samaj (UP) and Member, Red Cross, promoting folk dances and song\/cultural activities of Bundelkhand.","No.of Daughters":"1","Mother's Name":"Late Smt. Ganeshi Devi","Party Name":"Samajwadi Party(SP)","Profession":"Agriculturist Advocate","Date of Marriage":"08 May 1998","Favourite Pastime and Recreation":"Reading literature, watching national programmes on Doordarshan, specially interested to listen to national and international news, tree plantation and travelling","Constituency":"Jalaun (SC) (Uttar Pradesh )","Special Interests":"Social service, woring for promotion of Scientific Agriculture in rural areas, economical upliftment for economically weaker section of the society, promotion of primary and higher education in rural areas, interacting with people regularly and helping them to sort out their problems.","Date of Birth":"15 Dec 1972","Educational Qualifications":"M.A.(Acharya),LL.B.Educated at Sampoornanand Sanskrit Vishwavidyalaya, Varanasi and Bundelkhand University, Jhansi, Uttar Pradesh","No. of Sons":"1","Other Information":"Shri Ganesh Prasad Higher Secondary School, Urai, Distt. Jalaun (UP); Shri Bharat Kumar Girls Inter College, Hamirpur (UP) (i) Panel on Drought Mitigation Strategy, 2010; (ii) Committee on Subordinate Legislation; (iii) Committee on Member of Parliament Local Area Development Scheme; (iv) Advisory Committee on Steel; (v) Advisory Committee on Energy; (vi) Parliament Forum (Lok Sabha) on Disaster Management; (vii)Thailand Parliamentary Friendship Group; and (viii) Malaysia Parliamentary Friendship Group; attended Special Training Programme on Rural Development by Ministry of Rural Development, Hyderabad, attended Training Programme on Animal Conservation, Madras","Present Address":"\n67, North Avenue,\nNew Delhi - 110 001\nTels.(011) 23093603, 9013180366(M)\n\n\n\n","Email Address :":"ghanshyamanuragi@yahoo.com","Name":"Anuragi,Shri Ghanshyam","Marital Status":"Married","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4286.jpg","Positions Held":"\n1995-2000\nGram Pradhan, Kheda Shilajit, Hamirpur, Uttar Pradesh\n\n2000-2006\nChairman, Zila Panchayat, Hamirpur, Uttar Pradesh\n\n2004-2007\nMember, State Population and Development Commission, Govt. of Uttar Pradesh\n\n2009\nElected to 15th Lok Sabha\n\n31 Aug. 2009\nMember, Committee on Water Resources\n","Permanent Address":"\n3802, Patel Nagar, Urai,\nDistt. Jalaun, Uttar Pradesh\nTels. (0516) 2254666, 09415144666 (M)\n\n\n\n","Father's Name":"Late Shri Deshraj Anuragi","Spouse's Name":"Dr. Kalpana Anuragi"}