{"Place of Birth":"Sihal, Distt. Kangra (Himachal Pradesh)","Social And Cultural Activities":"Rescued scores of farmers from Bias River Catchment area by getting services of Army Helicopters in 1988; fought for the cause of students in 1978, led a historical agitation in which about 250 students including 50 girl students were jailed in Chandigarh jail.","Mother's Name":"Smt. Shakuntla Devi","Party Name":"Bharatiya Janata Party(BJP)","Profession":"Medical Practitioner Advocate Trade Unionist Horticulturist","Date of Marriage":"04 Dec 1985","Literary Artistic & Scientific Accomplishments":"Was given independent portfolio of Bio-Technology Minister in addition to Revenue Minister in Himachal Pradesh and was sucessful in making infrastructural base of Bio-Technology in Himachal Pradesh","Constituency":"Kangra (Himachal Pradesh )","Special Interests":"Issued \"Kisan Pass Books\" to all 13 lakh families in Himachal Pradesh H.P. while as a Revenue Minister of H.P.; changed 150 years old anti farmers laws i.e. \"Teh Jameen Malikan, Khudrao Drakhtan Malkiyat Himachal Sarkar\" since British time, resultantly lakhs of farmers were given the ownership right of such lands; also prepared dictionary in Hindi and English from Parsi language in revenue Department of Himachal Pradesh","Date of Birth":"30 May 1955","Educational Qualifications":"GAMS, B.A., LL.B. Educated at Dayanand Ayurvedic College Jalandhar (Punjab), H.P. University, Shimla and Punjab University, Chandigarh","No. of Sons":"2","Other Information":"Strongly opposed National Emergency, resultantly was put behind bars on 31.12.1975 at Chandigarh (Mohali) in Kamagata Maru Session of All India Congress; protested against Emergency in front of then Prime Minister Smt. Indira Gandhi and remained in jail for 7-8 months in Central Jail Patiala, Hoshiapur and Jalandhar; Sat on Dharna for 11 months in 1982; led historical agitation of farmers of Shah Nehar Area in H.P. and benefited more than 50,000 farmers irrigating 38000 Acres of land by getting largest Irrigation Project of H.P. costing more than 300 crores; Led agitation for the cause of Pong Dam ousters and was put in Dharmshila Jail and got success in allotting 1373 Murabbas to Pong Dam outees in Rajasthan; remained in Shimla and Bilaspur Jails for the cause of farmers and youths; Led a movement for labourers which benefited one lakh and fifty thousand labourers of H.P. and for this was jailed for more than seven months; undertook Historical March from Kanyakumari to Kashmir (Lal Chowk) as convener of H.P. under the leadership of Dr. M. M. Joshi, the then National President of BJP and was among 65 dare devils who unfurled Tricolour (Tiranga) in Lal Chowk and had a narrow escape of rocket lanched by Terrorists; Member, Sree Chitra Tirunal Institute for Medical Sciences and Technology, Thiruvananthapuram","Present Address":"\n83, North Avenue,\nNew Delhi - 110 001\nTels. (011) 23093372, 23093373, 9013180148 (M)\n\n\n\n","Name":"Sushant,Dr. Rajan","Marital Status":"Married","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4297.jpg","Positions Held":"\n1982-1985, 1985-1990, 1998-2003 and 2007-2009\nMember, Himachal Pradesh Legislative Assembly (four terms)\n\n1998 - 2003\nMinister of State, Revenue, Govt. of Himachal Pradesh\nMinister of State, Biotechnology (Ind), Govt. of Himachal Pradesh\n\n2009\nElected to 15th Lok Sabha\n\n31 Aug. 2009\nMember, Committee on Science & Technology, Environment & Forests\n\n23 Sep. 2009\nMember, Committee on Subordinate Legislation\nMember, Youth Welfare & Sports Committee\n","Permanent Address":"\nCollege Road, Dehri, Teh. Nurpur,\nDistt. Kangra, Himachal Pradesh\nTels. (01893) 250020, 09418311131 (M)\n\n\n\n","Father's Name":"Shri Faquir Chand","Spouse's Name":"Dr. Sudha Sushant"}