{"Place of Birth":"Sonepat (Haryana)","Sports and Clubs":"Rifle Shooting; Private pilot licence holder; and Member, All India National Rifle Association,","Social And Cultural Activities":"Working for the water supply in the rural and urban areas; create awareness among people about the importance of education and encourage primarily children and women to be educated;to arrange blood donation and health check up camps; to help NGO`s and social workers in fighting against social evils; and to work for the development of the villages.","Mother's Name":"Smt. Dhanapati Malik","Party Name":"Indian National Congress(INC)","Profession":"Agriculturist Political and Social Worker","Favourite Pastime and Recreation":"Listening to music, reading newspaper and religious books as well as meeting people","Constituency":"Sonipat (Haryana )","Special Interests":"Agricultural activites; acquiring information about latest technological development in the field of agriculture and making the farmer aware of them;and working for the upliftment of the downtrodden people of society.","Date of Birth":"12 Feb 1970","Educational Qualifications":"B.A., LL.B. Educated at Maharshi Dayanand University, Rohtak, Haryana","Other Information":", Haryana State Kisan Congress since, 1998; , All India Freedom Fighter Successor association (Haryana Pradesh) since 2008; and Distt. Congress Committee, Sonepat, since 2002; Father Late Shri Rajinder Singh had been Minister of Health, Food Supplies and Civil Aviation, Haryana; Grandfather Late Shri Lahri Singh had been the Minister of Irrigation & Power, United Punjab","Present Address":"\n151, South Avenue,\nNew Delhi - 110 011\nTels. (011) 23795158, 09013180158 (M)\n\n\n\n","Name":"Malik,Shri Jitender Singh","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4332.jpg","Positions Held":"\n1995-2000\nMember, Zila Parishad, Sonepat\n\n2000-2009\nMember, Haryana Legislative Assembly (two terms)\n\n2004-2005\nMember, Public Accounts Committee, Haryana Vidhan Sabha\n\n2005-2009\nMember, Committee on Public Undertaking Corporation, Haryana Vidhan Sabha\n\n2009\nElected to 15th Lok Sabha\nMember, Consultative Committe on Law and Justice\n\n31 Aug. 2009\nMember, Committee on Home Affairs\n\n23 Sep. 2009\nMember, Committee on Subordinate Legislation\n","Permanent Address":"\n14\/16, Rajender Nagar,\nSonipat, Haryana\nTel.(0130) 2241057\n\n\n\n","Father's Name":"Late Shri. Rajinder Singh"}