{"Place of Birth":"Vill. Bauri, Distt. Chandauli (Uttar Pradesh)","No.of Daughters":"2","Mother's Name":"Late Shakuntala Devi","Party Name":"Samajwadi Party(SP)","Profession":"Trading Business Agriculturist","Favourite Pastime and Recreation":"Watching Discovery Channel, Following Habits of Great Leaders, Stock Market Review, Reading Books on Investments by John Templeton and Warren Buffet, etc.","Constituency":"Chandauli (Uttar Pradesh )","Special Interests":"Indian economic development, encouraging investment in Indian capital markets, investors education and awareness,Communicating with Government Agencies for bringing Transparency in Indian Capital Markets, Empowerment of PSUs. Further maintain amiable Relationships with chairman of PSUs, Banks, Senior Bureaucrats of Regulatory Authorities, Industrialists, Economists etc.","Date of Birth":"03 Aug 1956","Educational Qualifications":"B.A., B.Ed. and Post Graduate Diploma in Marketing and Finance","No. of Sons":"1","Other Information":"Closely interacts with Industrialist, Bureaucrats, Stock Brokers, Merchant Bankers etc. for attracting Investments and making Indian Economy Robust and further highlight the issues of Corporates in Parliament which are hampering the growth of Indian Economy and suggest a Roadmap to policy makers to take steps which benefits exchequer. Further bring transparency in the pricing of IPOs in-order to broaden the participation in the Capital Markets by different entities.","Present Address":"\n114, North Avenue,\nNew Delhi - 110 001\nTelefax. (011) 23094303 8826583031 (M)\n\n\n\n","Email Address :":"ram.kishun@sansad.nic.in","Name":"Ramkishun,Shri","Marital Status":"Married","Countries Visited":"Widely travelled across world","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4346.jpg","Positions Held":"\n2002-09\nMember, Uttar Pradesh Legislative Assembly (two terms)\n\n2009\nElected to 15th Lok Sabha\n\n31 Aug. 2009\nMember, Committee on Labour\nMember, Consultative Committee, Ministry of Power\n\n3 May 2013\nMember, Committee on Welfare of Other Backward Classes (OBCs)\n","Permanent Address":"\nVill. Bauri, Post - Niyamatabad,\nDistt. Chandauli Uttar Pradesh\n\n\n\n\n","Father's Name":"Late Ganji Prasad","Spouse's Name":"Smt. Premlata Yadav"}