{"Place of Birth":"Nasik, Distt. Nashik (Maharashtra)","Sports and Clubs":"Follow both national and internatinal sports and lend support in organising them and special interest in Cricket and Tennis.","Social And Cultural Activities":"Organising popular Ganesh festival in the Mazgaon area, sponsoring and conducting cultural meets for the underprivileged at Nasik and yeola in order to integrate them into the mainstream, distribution of school uniforms, books and other educational aids to the poor as well as charitable donations for flood affected victims of Bihar and Cyclone victims of Tamil Nadu and Andhra Pradesh and organising blood donation, eye donation campaigns and medical aids for major surgery to poor patient.","No.of Daughters":"1","Mother's Name":"Smt. Hirabai Bhujbal","Party Name":"Nationalist Congress Party(NCP)","Profession":"Agriculturist Educationist Businessperson","Date of Marriage":"13 Feb 2005","Favourite Pastime and Recreation":"Taking keen interest in watching films as well as attending concerts in classical music as well as light music; and watching Marathi theatre for spreading social awareness.","Literary Artistic & Scientific Accomplishments":"Organising and sponsoring events in the field of fine arts; working as Trustee, Mumbai Educational Trust, which is involved in presentation of unique forms of performing arts, cultural and literary concerts and workshops; thousands of students and performers from all sections of society have been participating in these events at Mumbai, Nasik and Yeola.","Constituency":"Nashik (Maharashtra )","Special Interests":"(i) Keen interest in wildlife observation and conservation of both wildlife and nature and creating awareness about the importance of maintaining ecological balance; and (ii) developing hi-tech farming systems for horticultural and agro-industrial farming community and for that purpose, carried farmers to participate in agri-business meet in Israel and built up platform for knowledge and technology exchange for grapes and wine farmers in Nasik","Date of Birth":"09 Oct 1973","Educational Qualifications":"Matriculate Educated at St. Mary`s Convent High School, Maharashtra","Other Information":"(i) Presenting MET at UN ECOSOC, New York deliberations for the participation of NGOs in Millennium Development Goals (MDG) in India and South East Asia and have been granted \"Special Consultative Status with the UN ECOSOC\" in 2003; (ii) at present national leader for developing excellence in the NGOs working for MDG in South East Asia; (iii) besides implementing Paperless Committee Project for rural poor, another programme `Project-Truth` covering 20,000 tribal families has also been implemented in Thane District; (iv) being a social activist and a trustee of \"Akhil Bhartiya Mahatma Phule Samata Parishad\"; and promoting teachings of Mahatma Jyotiba Phoole, launched educational training and development centres, aimed at offering care, concern and compassion for children, youth as well as senior citizens.","Present Address":"\n169, South Avenue,\nNew Delhi -110 011\nTels. (011) 23795393, 9013180207 (M) Fax. (011) 23795222\n\n\n\n","Email Address :":"mp@sameerbhujbal.com","Name":"Bhujbal,Shri Sameer Magan","Marital Status":"Married","Countries Visited":"Australia, France, Germany, Indonesia, Italy, Singapore, South Africa, Sri Lanka Switzerland, U.A.E, U.K, and U.S.A.","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4377.jpg","Positions Held":"\n2009\nElected to 15th Lok Sabha\n\n31 Aug. 2009\nMember, Standing Committee on Petroleum and Natural Gas\n\nSep. 2009\nMember, Consultative Committee on Railway\n\n16 Mar. 2010\nMember, Parliamentary Forum on Water Conservation and Management\n\n22 Jul. 2010\nPresident, India-Bangladesh Parliamentary Friendship Group\n\n29 Jul. 2010\nMember, India-Portugal Parliamentary Friendship Group\n\n3 May 2013\nMember, Committee on Welfare of Other Backward Classes (OBCs)\n","Permanent Address":"\n(i) Chandrai Bunglow, Bhujbal Farm,\nNew Nasik-422 009 Maharashtra\nTel. (0253) 2394351 Fax. (0253) 2394352\n(ii) Ramtek, N.D. Marg, Mumbai\nMaharashtra\nTel.(022) 23631688 Fax. (022) 23698585\n","Father's Name":"Shri Magan Bhujbal","Spouse's Name":"Smt. Shefali Bhujbal"}