{"Place of Birth":"New Delhi","Sports and Clubs":"Golf, cricket, tennis, swimming, horse riding; Member (i) Air Force Club, Delhi; (ii) Delhi Golf Club; (iii) India Habitat Centre; (iv) India International Centre; (v) Fort William, Kolkata; (vi) Tollygunje Club, Kolkata;(vii) Royal Calcutta Golf Club;(viii) Saturday Club; (ix) Bengal Club; (x) South Club; (xi)International Club etc.; Member of MP`s cricket team; and won trophies in golf tournaments","Social And Cultural Activities":"Actively involved in (i) students`s affairs both in India and abroad;and (ii) consumer protection movement; was President, International Students` Association, University of Texas, USA; Member of voluntary organization like Special Police (Traffic Warden), Round Table India, etc; fighting criminalisation in politics; filed several public interest litigations including Vohra Committee (Right to Information is a fall out of petiton on Vohra Committee)","Mother's Name":"Late Shirmati Urmilaben Trivedi","Party Name":"All India Trinamool Congress(AITC)","Profession":"Political and Social Worker","Date of Marriage":"12 Dec 1977","Literary Artistic & Scientific Accomplishments":"Written several articles in leading newspapers and given lectures on various subjects including politics, economics, management, civil aviation, history etc. at various national and international forums; and participated in prestigious debates","Constituency":"Barrackpur (West Bengal )","Special Interests":"Reading, meeting people, music and films; and pilot licence-flying training in India and advance training in USA","Date of Birth":"04 Jun 1950","Educational Qualifications":"B. Com, M.B.A. Educated at St. Xavier`s College, Calcutta University and University of Texas, USA","No. of Sons":"1","Other Information":"Chairman (i) Indo EU Parliamentarians forum; and (ii)Calcutta International School; Member (i) Indo American Forum of Parliamentarians; (ii) Indo British Forum of Parliamentarians; (iii) Indo France Forum of Parliamentarians; (iv) Indo German Forum of Parliamentarians; (v) Indo UK Forum of Parliamentarians; (vi) Indo Japan Forum of Parliamentarians; (vii) Aspan Dialogue, USA; and (viii) Aspan Euro; Managing Trustee, Consumer Protection Centre, Kolkata","Present Address":"\n4, Lodhi Estate\nNew Delhi-110 003\nTels. (011) 24641124 (R), 23061016, 23061551 (O), Fax. (011) 24647323 (R), 23062828 (O)\n\n\n\n","Email Address :":"dintriv@gmail.com","Name":"Trivedi,Shri Dinesh","Marital Status":"Married","Countries Visited":"Widely travelled","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4487.jpg","Positions Held":"\nApr.1990\nElected to Rajya Sabha\n\nApr. 2002\nRe-elected to Rajya Sabha ( 2nd term)\nNominated, Panel of Vice-Chairmen, Rajya Sabha\nChairman, Passengers Amenities Committee, Ministry of Railways\nMember, Rules Committee\nMember, Consulatative Committee, Ministry of Civil Aviation\nMember, Committee on Finance\nMember, Committee on Commerce\nMember, Committee on Petitions\nMember, Committee on Public Undertakings\nMember, Genral Purposes Committee\nCo-Convenor, Sub-Committee for Speical Economic Zones, Committee on Commerce\n\n2009\nElected to 15th Lok Sabha\n\n2009\nUnion Minister of State, Health and Family Welfare\n\n19 Jan 2011 - 19 July 2011\nUnion Cabinet Minister of State, Health and Family Welfare\n\nJuly 2011 - 19 Mar. 2012\nUnion Cabinet Minister, Railways\n","Permanent Address":"\n8 - A, Vivek Vihar, 13\/3 Pramathesh Barua Sarani ( Ballygunge Circular Road)\nKolkata - 700 019, West Bengal\nTels. (033) 24866503, 09830050499 Fax. (033) 20520102\n\n\n\n","Father's Name":"Late Shri Hiralal Trivedi","Spouse's Name":"Dr. (Mrs) Minal Trivedi"}