{"Place of Birth":"London (England)","Sports and Clubs":", (i)City Cricketers, Thiruvananthapuram; (ii) India International Centre; and (iii) Kerala International Centre; and Captained, Ministry of External Affairs Cricket team, 2009-10","Social And Cultural Activities":"Columnist and Writer, Indian and International Publications; (i) Contributing Editor and Occasional columnist, Newsweek International; and (ii) Public Speaker on Indian and Global Issues for two years","Mother's Name":"Smt. Lily Tharoor","Party Name":"Indian National Congress(INC)","Profession":"Diplomat Writer International Civil Servant","Date of Marriage":"22 Aug 2010","Favourite Pastime and Recreation":"Cricket, reading, writing, theatre, movies and media","Literary Artistic & Scientific Accomplishments":"(i) A Commonwealth Writers Prize, 1991 and other literary and Journalistic awards; and (ii) A Pravasi Bharatiya Samman, 2004; Named at World Economic Forum (WEF), Davos, Switzerland, 1998; awarded (i) Robert B. Stewart Prize for the Best Student, The Fletcher School of Law and Diplomacy, Tufts University; (ii)an honorary D.Litt.,University of Puget Sound; and (iii) Doctorate University of Bucharest, Romania; Fletcher Forum of International Affairs, Fletcher","Constituency":"Thiruvananthapuram (Kerala )","Special Interests":"International Affairs, Literature, Cricket, Theatre, The United Nations, Human Rights; and served The United Nations for 29 year career(1978-2007)","Date of Birth":"09 Mar 1956","Educational Qualifications":"B.A. (Hons), M.A., M.A.L.D, Ph.D., D.Litt (Honorary), Dr. Honoris Causa Educated at St Stephen`s College, Delhi University, New Delhi and Fletcher School of Law and Diplomacy at Tufts University, U.S.A.","No. of Sons":"2","Other Information":"Communications and Public Information, U.N., 2001-2007; Secretary General, U.N.,1997-2000; Special Asst.,USA\/UN for peacekeeping, 1989-1996; , Secretariat, UNCHR, 1985-89; , Singapore Office, UNHCR, 1981-84; and , UNHCR, 1978-81; (i)Board of Overseers, Fletcher School of Law and Diplomacy, the board of trustees of the Aspen Institute; (ii) Advisory Boards of the Indo-American Arts Council, the American India Foundation, the World Policy Journal, the Virtue foundation and the human rights organization `Breakthrough`; an International Adviser to the International Committee of the Red Cross, Geneva, 2008-11; New York Institute of the Humanities and the Patron of the Dubai Modern School; (i) the Pride of India Award, the Zakir Husain Memorial Foundation, Nagpur; and (ii)The Hakim Khan Sur Award for National Integration, presented by Maharana of Udaipur; , Sree Chitra Tirunal Institute for Medical Sciences and Technology, Trivandrum","Present Address":"\n97, Lodhi Estate,\nNew Delhi - 110 003\nTels. (011) 24644035, 24657372 (R), 23384073, 23386163 (O), 9971020499 (M) Fax: (011) 24654158 (R), 23387771 (O)\n\n\n\n","Email Address :":"1. office@tharoor.in 2.shashi.tharoor@sansad.nic.in","Name":"Tharoor,Dr. Shashi","Marital Status":"Married","Countries Visited":"Widely travelled","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4569.jpg","Positions Held":"\n2009\nElected to 15th Lok Sabha\n\n23 May 2009 - 18 Apr. 2010\nUnion Minister of State, External Affairs\n\n30 Apr. 2010\nMember, Committee on External Affairs\n\n4 May 2010\nMember, Consultative Committee, Ministry of Defence\n\n28 Oct. 2012 onwards\nUnion Minister of State, Human Resource Development\n","Permanent Address":"\nApt. Gj, Condor Marigold, Bhakthy Vilasam RD.Vazhuthacaud,\nThirvananthapuram - 695 014 Kerala\nTels. (0471) 2324555, Fax. (0471) 2324666\n\n\n\n","Father's Name":"Shri Chandran Tharoor","Spouse's Name":"Smt. Sunanda P. Tharoor"}