{"Place of Birth":"Shirambe, Distt. Satara (Maharashtra)","Sports and Clubs":"Swimming","Social And Cultural Activities":"Arranged medical camps, sports tournaments (indoor-outdoor) and training centre for banking industry employees; fighting for justice to the poor, uneducated and downtrodden; organising people for their social and economic progress; redressing the grievances of the suppressed people","No.of Daughters":"2","Mother's Name":"Late Smt. Venubai Adsul","Party Name":"Shiv Sena(SS)","Profession":"Agriculturist Diplomat Trade Unionist","Date of Marriage":"12 May 1973","Favourite Pastime and Recreation":"Listening to music , reading and watching T.V.","Constituency":"Amravati (SC) (Maharashtra )","Special Interests":"Social work and trade union","Date of Birth":"01 Jun 1947","Educational Qualifications":"B.Com. Educated at Shivaji University, Kolhapur(Maharashtra)","No. of Sons":"1","Other Information":"(i) Development Board for Rest of Maharashtra, 1999; (ii) Maharashtra State Small Scale Industrial Development Corporation, 1995-97; (iii) Vigilance and Monitoring Committee in Buldhana District, Maharashtra since October 2004; (iv) Maharashtra Urban Cooperative Banks Federation; (v) The City Cooperative Bank Ltd. Mumbai, Maharashtra; (i) Co-operative Bank Employees Union, Mumbai, February 1985 onwards, (ii) Maharashtra State Co-operative Credit Societies Employees Union, Mumbai, (iii) Maharashtra State Housing Finance Employees Union, 1992 onwards; (iv) Rashtriya Chemicals & Fertilizers Employees Union, 1999 onwards, and (v) Rail Kamagar Sena, 2001 onwards; (i) Co-operative Bank Employees Union, Nasik, Thane, Kolhapur , Satara, Sindhudurga, Ratnagiri, Raigad Distt., Maharashtra, 1987 onwards; (ii) Maharashtra State Land Development and Rural Development Bank Employees Association, 1987 onwards; (iii) Mechanical Engineers Association, Mumbai; (iv) All India Coal Mines Kamgar Sangathana, Nagpur, 1998-2003; (v) Maharashtra Rajya Kharedi Vikri Sangh; (vi) Maharashtra Rajya Sakhar Sangh Karmachari Sangh; and (vii) Akhil Bhartiya Tapal Kamgar Sena; (i) Hind Kisan Kamgar Sangathan, Mumbai, 1998-2003; Sthaniya Lokadhikar Samiti, Maharashtra 1998 onwards; Joint Secretary, All India Union Co-operative Bank Employees Federation, 1989 onwards; (i) Maharashtra State Co-operative Bank Employees Federation 1989 till date; and (ii) Maharashtra State Co-operative Bank Ltd., since 1989 till date, (i) Wages Board Co-operative Banking Industry, 1993-2003 and (ii) Monitoring Group for implementation of the recommendations of the All India Whips Conference; Ex-Officio Member, State Planning Commission, July 1999; awarded (i) Gunwant Kamgar Puraskar, Government of Maharashtra on 1 May 1986; (ii) Utkrushta Sahakari Bank Kamgar Neta on 7 October, 2001 for Co-opeative Banking Industry; diploma in Role of Labour Movement in National Development organised by the International Institute, Government of Israel.","Present Address":"\nAB-9, Pandara Road,\nNew Delhi - 110 003\nTels. (011) 23074036, 9868180266 (M) Telefax: (011) 23074036\n\n\n\n","Email Address :":"adsul@sansad.nic.in","Name":"Adsul,Shri Anandrao","Marital Status":"Married","Countries Visited":"Australia, France, Germany, Hong Kong, Israel, Malaysia, Nepal, New Zealand, Singapore, Thailand, U.K. and U.S.A.","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/8.jpg","Positions Held":"\n1996\nElected to 11th Lok Sabha\n\n1999\nRe-elected to 13th Lok Sabha (2nd term)\n\nOct. 1999-Jul. 2002\nChief Whip, Shiv Sena Parliamentary Party, Lok Sabha\n\n1999-2002\nMember, Committee on Human Resource Development\n\n2000-2002\nMember, Committee on Transport and Tourism\n\n2000-Mar. 2002\nMember, Consultative Committee, Ministry of Railways\n\nJul. 2002-Aug. 2002\nLeader, Shiv Sena Parliamentary Party\n\n26 Aug. 2002 - May 2004\nUnion Minister of State, Ministry of Finance and Company Affairs\n\n2004\nRe-elected to 14th Lok Sabha (3rd term)\nMember, Committee on Petroleum & Natural Gas\nMember, Consultative Committee, Ministry of Civil Aviation\nMember, Committee on Government Assurances\nMember, Informal Consultative Committee for Central Railways\n\n5 Aug. 2007\nMember, Committee on Transport & Tourism & Culture\n\n2009\nRe-elected to 15th Lok Sabha (4th term)\n\n6 Aug. 2009\nMember, Committee on Public Accounts\n\n31 Aug. 2009\nMember, Committee on Petroleum and Natural Gas\n\n23 Sep. 2009\nMember, Committee on Government Assurances\n\n5 May 2010\nMember, Committee on Public Accounts\n","Permanent Address":"\n5\/B, Kadamgiri Apartment, Co-operative Housing Society Ltd.,\nAshok Nagar, Chakravarti Ashok Road, Kandivali (East), Mumbai - 400 101, Maharashatra\nTels. (022) 28871042, 28863403(R) 24371860, 24371755(O)\n\n\n\n","Father's Name":"Shri Vithoba Adsul","Spouse's Name":"Smt. Mangala"}