{"Place of Birth":"Kannur (Kerala)","Social And Cultural Activities":"Associated with several educational, cultural and social institutions","Sports and Clubs":"Football and cricket","Mother's Name":"Late Smt. Nafeesa Beevi","Party Name":"Indian Union Muslim League (IUML)","Favourite Pastime and Recreation":"Reading,writing and music","Special Interests":"Promotion of education, establishing schools and institutions","Other Information":"Kerala State Rural Development Board (Statutory Board of Govt. of Kerala), 1971-77; Kerala State Small Scale Industries Development Corporation, 1979-80; Crisis Management Group during Iraq hostage crisis, August-September, 2004 (i)Muslim Educational Foundation, Panur, Kannur, Kerala; (ii) Kannur Deenul Islam Sabha Regd. Kerala; (i) Board of the Medical College, Pariyaram, Kerala; (ii) Managing Committee, MEA Engineering College, Malappuram, near Perinthalmanna, Kerala; (iii) Executive Council, Aligarh Muslim University; and (iv) Central Haj Committee, 2003","Email Address :":"eahmed@sansad.nic.in","Present Address":"\n9, Teen Murti Marg,\nNew Delhi - 110 011\nTels. (011) 23017051, 23017052 (R) (011)23014118, 23015716 (O) Fax. (011) 23013800 (R), 23792804 (O)\n\n\n\n","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/10.jpg","Permanent Address":"\n`Sitara`, Thana Kannur - 670 012\nKerala\nTels. (0497) 2706713, 2769560\n\n\n\n","Spouse's Name":"Late Smt. Zuhara Ahamed","No.of Daughters":"1","Date of Marriage":"14 May 1961","Profession":"Advocate Political and Social Worker","Constituency":"Malappuram (Kerala )","Literary Artistic & Scientific Accomplishments":"Executive Director, Chandrika, Daily and Weekly; also contributes articles to journals","Date of Birth":"29 Apr 1938","No. of Sons":"2","Educational Qualifications":"B.A., B.L. Educated at Government Brennen College, Tellicherry and Government Law College, Thiruvananthapuram, Kerala","Name":"Ahamed,Shri E.","Marital Status":"Widower","Countries Visited":"Widelly travelled; Meeting of Heads of Indian Missions of GCC countries, Doha, 18th & 19th March 2006; of the then Prime Minister Late Smt. Indira Gandhi and met Heads of States of the Gulf Countries, 1984; (i) Trade delegation of government of India to Gulf Countries, 1984; (ii) Indian Ocean Rim Association for Regional Co-operation Ministerial Meeting, Colombo, August, 2004; (iii) Signing of Sudan Peace Agreement, Nairobi, January 2005; (iv) Small Island developing States Meeting, Mauritius, January, 2005; (v) League of Arab States Summit, Algiers, March, 2005; (vi) Sudan donors Conference, Oslo, April, 2005; (vii) South Summit\/G-77 Ministerial Confernce at Doha, Qatar, June, 2005; (viii) Review Conference on Financing for Development, United Nations General Assembly, June, 2005; (ix) Regional Ministerial Meeting of Asia and Pacific on Millennium Development Goals, Jakarta, August, 2005; (x) Lebanon and Syria on a Bilateral visit from 27 Sept. 2005-1 Oct. 2005; (xi) 26 Session of SAARC Summit, Dhaka, 10-13 November, 2005; (xii) International Donors Conference, Islamabad, 18-22 November, 2005; (xiii) 6th Indian Ocean Rim Associaton for Regional Cooperation Ministerial and Senior officals meeting, Tehran, 20-22 February,2006; (xiv) Eighteenth Summit of League of Arab States, Khartoum, Sudan, 28-30 March, 2006; (xv) 10th Session of India-Tunisia Joint Commission meeting, Tunisia, 5-8 February, 2007; (xvi)7th Council of Ministers meeting of Indian Ocean Rim Association for Regional Cooperation (IOR-ARC), Tehran, 3-8 March, 2007; (xvii) 6th Asia Cooperation Dialogue Ministerial Meeting, Seoul, South Korea; (xviii) NAM Ministerial Meeting on Human Rights and Cultural Diversity, Tehran, Iran, 3-4 September, 2007; (xix) Heads of State Council meeting of the Member & Observer States of the Shanghai Cooperation Organisation, Tashkent, 1-3 November , 2007; (xx)62nd Session, UNGA, New York, 29 November-3 December, 2007; (xxi) 31st Session of SAARC Council of Minsiters meeting, Colombo, 27 February, 2009;(xxii) NAM Ministerial Meeting, Havana 29-30 April, 2009; (xxiii) League of Arab States Summit, Algiers, 2005; Khartoum, 2006; Riyadh, 2007; Damascus, 2008; Doha, 2009; Leader, Fact Finding Team, Mina Fire Tragedy, Saudi Arabia, 1997; (i) Indian Delegation in the UN General Assembly, 1992-97; (ii) Indian Delegation to World Social Summit Copenhagen, 1995; (iii) Indian parliamentary Delegations to various countries, 1994-2001;and (iv) Indian World Parliamentary Conference, Amman, Jordan, 2000; Indian Parliament in Commonwealth Parliamentary Joint Colloquium at Buckinghamshire, U.K., 1998; (i) Former Vice President, Shri Bhairon Singh Shekhawat in the funeral of ruler of Dubai H. H. Sheikh Makhtoum Rashid Al-Makhtoum on 5 January 2007; (ii) Hon`ble Vice President of India to Turkmenistan and Kazakhstan, April 4-10, 2008; (iii) Prime Minsiter of India to Oman and Qatar, 8-9 November, 2008;","Positions Held":"\n1967-91\nMember, Kerala Legislative Assembly (five terms)\n\n1981-83\nChairman, Municipal Council, Kannur, Kerala\n\n1982-87\nCabinet Minister, Industry, Govt. of Kerala\n\n1987-91\nChairman, Committee on Government Assurances, Kerala Legislative Assembly\n\n1991\nElected to 10th Lok Sabha\n\n1992-94\nMember, Committee on Subordinate Legislation\n\n1993\nMember, Consultative Committee, Ministry of Civil Aviation and Tourism\nSpecial Permanent Member, Consultative Committee, Ministry of External Affairs\n\n1993-94\nChairman, Committee on Absence of Members from the Sittings of the House\n\n\n1994-96\nMember, Committee on Public Undertakings\nMember, Committee on Science and Technology, Environment and Forests\n\n1995 onwards\nGeneral Secretary, Indian Union Muslim League (IUML)\n\n1996\nRe-elected to 11th Lok Sabha (2nd term)\nChairman, Committee on Government Assurances\nMember, Committee on Railways\n\n1998\nRe-elected to 12th Lok Sabha (3rd term)\nChairman, Committee on Government Assurances\nMember, Committee on External Affairs\nMember, Consultative Committee, Ministry of Civil Aviation\n\n1999\nRe-elected to 13th Lok Sabha (4th term)\nChairman, Joint Committee on Food Management in Parliament House Complex\nMember, Committee on Government Assurances\n\nMember, Consultative Committee, Ministry of Civil Aviation\nMember, Committee on External Affairs\nMember, Committee on Provision of Computers to Members of Parliament\n\n2003\nMember, Joint Parliamentary Committee on Pesticide residues in and safety standards for soft drinks, fruit juice and other beverages\n\n2004\nRe-elected to 14th Lok Sabha (5th term)\n\n22 May 2004\nUnion Minister of State, Ministry of External Affairs\n\n14 Sep. 2008\nNational President, Indian Union Muslim League (I.U.M.L.)\n\n2009\nRe-elected to 15th Lok Sabha (6th term)\nLeader, Muslim League Kerala State Committee Parliamentary Party, Lok Sabha\n\n2009 - 18 Jan 2011\nUnion Minister of State, Railways\n\n\nMar. 2010\nMember, Parliamentary Forum on Population and Public Health\n\n19 Jan 2011 onwards\nUnion Minister of State, External Affairs\n\nJuly 2011 - 28 Oct. 2012\nUnion Minister of State, Human Resource Development\nLeader, Indian Union Muslim League Parliamentary Party, Lok Sabha\n","Father's Name":"Late Shri Abdul Khader Haji"}