{"Place of Birth":"Delhi","Sports and Clubs":"Member, India International Centre, New Delhi and India Habitat Centre, New Delhi","No.of Daughters":"2","Party Name":"Bharatiya Janata Party(BJP)","Profession":"Professor","Date of Marriage":"13 Dec 1966","Literary Artistic & Scientific Accomplishments":"Specialisation in spectroscopy, supervised the research work of about a dozen students for the award of D. Phil and D. Sc; Professor of Physics in Allahabad University till January 1994, retired as Head of Physics Department, delivered lectures on scientific subjects in several symposia and conferences; Established, (i) Vaichariki (group of thinkers), an inter-disciplinary academic group, Allahabad; and (ii) Gyan Kalyan Charitable Trust; Trustee, (i) Bhau Rao Deoras Nyas; (ii) Madhav Shodh Sansthan Trust; and (iii) Uttaranchal Vikas Committee; Life Member, Allahabad Education Society; Member, (i) High Power Committee on Education in Uttar Pradesh, 1968; (ii) Governing Council of Indian Institute of Science, Bangalore 1977-79; (iii) Uttar Pradesh Committee on Science and Technology (Physics Branch), 1977-79; and (iv) Railway Accident Enquiry Committee headed by Justice Sikri, 1978-80","Constituency":"Varanasi (Uttar Pradesh )","Date of Birth":"05 Jan 1934","Educational Qualifications":"M.Sc. (Physics), D. Phil. Educated at Allahabad University, Allahabad, Uttar Pradesh","Other Information":": , University Teacher`s Association, Allahabad, 1971-73; (i) University Teachers`Assocation, Allahabad., 1987-90; (ii) President, India-Hungary Parliamentary Friendship Group; Firm believer in the concept of Swadeshi and the spiritual and cultural values of Hindutva; known for his views on the onslaught of foreign multinationals; vigorously undertook the campaign against foreign infiltrators, had demanded (1967) that India should go nuclear; raised several issues of public interest in Parliament including the drinking water problem, trade in human organs, share scam, rising foreign debt; a strong advocate of a modern, strong and ‘debt free India’; was Incharge of Youth Wing of B.J.S.; arrested in 1948 for offering Satyagraha for removing ban on R.S.S. and later participated in several B.J.S. movements and jailed several times; detained under M.I.S.A. during Emergency, 26 June 1975 to March 1977; as President of B.J.P. undertook Ekta Yatra from Kanyakumari to Srinagar and hoisted National Flag at Lal Chowk, Srinagar, Jammu and Kashmir on the Republic Day, 1992; was arrested on 8 December 1992 after the incidents in Ayodhya on 6 December, 1992 and detained at Mata Tila and re-arrested in December 1993 and detained at Pipri; Inter-Parliamentary Union (IPU) Conference in 1977; 1991; , (i) several conferences on Swadeshi throughout the country; (ii) the European Hindu Conference held at Frankfurt, Germany, 1991; (iii) Global Vision 2000 International Conference held in U.S.A.; (iv) International Youth Conference held at Chicago in 1993 to mark 100th Anniversary of Swami Vivekanand’s Address to the Parliament of Religions; (v) International Seminar on Science and Religion held at Washington in 1993; (vi) Vishwa Hindu Mahasangh Conference at Varanasi in 1993; and (vii) World Hindu Conference in Durban, South Africa in 1995; (viii) European Science Congress, 2002; (ix) European Research Council at Brussels in 2002 and (x) Commeonwealth Science Council Ministerial Gathering, South Africa, June, 2002; , (i) Science and Indian Philosophy, Durban, 1995; (ii) Cultural Policies for Development at the International Governmental Conference, Stockholm, 1998,(iii) Second Parliament of Science, Religion and Philosophy at the World Philosopher Meet on Science, Spirituality and Development, Geneva, 1998; (iv) Science and Religion in Frankfurt, Germany, 1991, (v) 8th Bose-Einstein Lecture on Science, Technology and Enviroment in 1998; (vi) Sustainable Consumption at Bonn University, Germany 2000; St. Petersburg, 2000; Brazil Academy of Science, Rio-de-Janerio, 2000-2001; (vii) UNESCO Conference, Paris; and (viii) World Conference on Science at Budapest, Germany, , (i) G-77 Conference, Cuba; (ii) UN Conference on Women, UNO; and (iii) UN Summit on Children, New York, 2002; , (i) UNESCO Sponsored International Conference on `Dialogue Among Civilizations` held at Delhi from 9 to 11 July 2003; (ii) UNESCO Conference in `Education for All - 2003`, held in New Delhi; (iii) Third World Academy Conference, New Delhi; (iv) Climate Change Conference, New Delhi; and (v) International Conference on Mapping, Bangkok and London; (i)India at Global Dharma Conference at New Jersey, USA in 2003 to mark the 100th anniversary of the Mahasamadhi of Swami Vivekananda; and represented India at the UNESCO Conference held in China, Paris and Egypt (Bioethics); a keynote address in World Sanskrit Conference, Bangkok; Presided over Unesco Conference on Education for All - Nepal All - Nigeria Addressed Commonwealth Science Council Ministrial Gathering at South Africa, June 2002; has the distinction of being the first Indian Minister to address the European Science Congress at Brussels in 2002; on (i) \"Sanskrit in Asia: Unity in Diversity\" held at Bangkok (Thailand) on 23rd June, 2005; and (ii)\"Dialogue of Cultures and Civilizations in the Global World\" held at St. Petersburg on 24-25 May, 2007; of Indian Parliamentary Delegation to Copenhagen Conference on Climate Change 2009; Participated in the 10th International Likhachov Scientific Conference on \"Dialogue of Cultures and Partnership of Civilizations: The Making of Global Culture\" held at St. Petersburg on May 13-14, 2010. Included to the Conference organising Committee as an honarary member (i) Jawaharlal Nehru Award by the Indian Science Conference, 1999; (ii) Nicolay Rerikh Medal for his contribution in the sphere of Ecology by the International Academy of Ecology, Man and Nature Protection Sciences, St. Petersburg; (iii) National Citizens Award India, 2001; (iv) Friendship Medals by the President of Mongolia in July, 2002 for his contribution towards development of relationship between India and Mongolia; and (v) Life Time Award by the Indian Science Congress, 2004; (i) Degree of D.Sc. (Honoris Causa) by the Universities of Kanpur, Gorakhpur, Banaras and Kurukshetra and (ii) Degree of Mahamahopadhyay by Tirupati Sanskrit Vidyapeetha (Deemed University) and by Sampuranand Sanskrit Vidyapeetha; , Vigyan Parishad and honoured by National Academy of Science (India) as an external fellow; elected fellow of Russian National Academy of Natural Sciences in 2001 whose membership includes world famous scientists and noble laureates; his biographical summary was published in the Encyclopedia of the Academy; , Forum of Parliamentarians on TRIPPS and GATT; elected as Honorary Academician on Ecology Section by International Academy of Ecology, Man and Nature Protection Sciences, Russian Federation; an advocate of sublime Indian values and ancient scientific knowledge; scientific temper, development of science and technology and their applications for removal of poverty; protagonist of holistic view of science and philosophy; his main interest is the study of science and universal consciousness, integral humanism and holistic values of life in the present world; proponent of sustainable consumption, an idea which has become a live issue in the world.","Present Address":"\n6, Raisina Road,\nNew Delhi - 110 001\nTels. (011) 23718444, 23326080 Fax. (011) 23711772\n\n\n\n","Email Address :":"murli@sansad.nic.in","Name":"Joshi,Dr. Murli Manohar","Marital Status":"Married","Countries Visited":"Widely travelled","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/172.jpg","Positions Held":"\n1944\nJoined Rashtriya Swayamsevak Sangh (R.S.S)\n\n1949\nJoined Akhil Bhartiya Vidyarthi Parishad (A.B.V.P)\n\n1953-56\nGeneral Secretary, Akhil Bhartiya Vidyarthi Parishad (A.B.V.P.), Uttar Pradesh\nAll India General Secretary, Akhil Bhartiya Vidyarthi Parishad (A.B.V.P.)\n\n1957\nOrganising Secretary, Bharatiya Jana Sangh (B.J.S.), Allahabad\n\n1959-67\nZonal Organising Secretary, B.J.S., Uttar Pradesh\n\n1967-75\nSecretary, B.J.S., Uttar Pradesh\nTreasurer, B.J.S., Uttar Pradesh\nVice-President, B.J.S., Uttar Pradesh (prior to its merger in Janata Party)\n\n1977\nElected to 6th Lok Sabha\n\n1977-79\nGeneral-Secretary, Janata Party in Parliament\n\n1980\nFounder General Secretary, B.J.P.\n\n1981-83\nTreasurer, B.J.P.\n\n1986-90\nGeneral-Secretary, B.J.P.\n\n1991-93\nPresident, B.J.P.\n\n1992-96\nElected to Rajya Sabha\nMember, Committee on Science and Technology, Environment and Forests\nMember, Select Committee on Patent Law\nMember, Select Committee on Trade Marks Bill\nMember, Committee on Public Undertakings\n\n1996\nRe-elected to 11th Lok Sabha (2nd term)\n\n16 May -1 Jun. 1996\nUnion Cabinet Minister, Home Affairs\n\n1996-97\nChairman, Public Accounts Committee\nMember, Committee on Finance\nMember, Consultative Committee, Ministry of Defence\nMember, Expert Committee on Low Productivity Areas, Ministry of Agriculture and Co-operation\n\n1998\nRe-elected to 12th Lok Sabha (3rd term)\n\n1998-99\nUnion Cabinet Minister, Human Resource Development; Science and Technology and Ocean Development\n\n1999\nRe-elected to 13th Lok Sabha (4th term)\n\n13 Oct. 1999 - 21 May 2004\nUnion Cabinet Minister, Human Resource Development; Science & Technology and Development\n\nJuly 2004 - 15 May, 2009\nMember, Rajya Sabha\n\nAug. 2004-09\nChairman, Standing Committee on Ministry of Commerce\nMember, General Purposes Committee\nMember, Consultative Committee, Ministry of Finance\n\n10 Mar. 2006\nPresident, India-Hungary Parliamentary Friendship Group\n\n2009\nRe-elected to 15th Lok Sabha (5th term)\n\n7 Aug. 2009\nMember, Council of the Indian Institute of Science, Banglore\n\n31 Aug. 2009 - 5 May 2010\nChairman, Ministry of Finance\n\n16 Sep. 2009\nMember, Consultative Committee, Ministry of Defence\n\n7 Oct. 2009\nMember, Committee on Ethics\n\n19 Oct. 2009\nMember, General Purpose Committee\n\n31 Jan. 2010\nMember, Parliamentary Forum on Global Warming and Climate Change\n\n1 May 2010\nChairman, Committee on Public Accounts\nMember, Committee on Budget\n","Permanent Address":"\n(i) 4, Ground Floor, B-Block, Virat Villa,\nMehmoorganj, Varanasi - 221 010 Uttar Pradesh\nTel. (0542) 2222377 Fax. (0542) 2226377\n(ii) `Aangiras` 9\/10 - A Tagore Nagar,\nAnukul Chandra Banerji Road Allahabad - 211 002 Uttar Pradesh\nTel. (0532) 2465008\n","Father's Name":"Late Shri Man Mohan Joshi","Spouse's Name":"Smt. Tarla Joshi"}