{"Place of Birth":"Kanpur (Uttar Pradesh)","Sports and Clubs":", (i) Calcutta Cricket and Football Clubs; (ii) Tollygunj Club, Calcutta; (iii) Delhi Flying Club, and , Delhi Distt. Cricket Association","Mother's Name":"Smt. Leela Nath","Party Name":"Indian National Congress(INC)","Profession":"Political and Social Worker Agriculturist","Date of Marriage":"27 Jan 1973","Favourite Pastime and Recreation":"Listening to music","Constituency":"Chhindwara (Madhya Pradesh )","Special Interests":"Development of tribals and the oppressed classes, wild life, horticulture and socio-economic issues","Date of Birth":"18 Nov 1946","Educational Qualifications":"B.Com. Educated at St. Xavier’s College, Calcutta,West Bengal","No. of Sons":"2","Other Information":"During his tenure as Minister of Environment & Forests, he made a remarkable contribution to the enunciation and development of the National Policy on Ecological Conservation and the Abatement of Pollution; his policy initiatives include: estabilishment of Environment Tribunal, the concept of Environment Audit, special measures for the further protection and conservation of wild life-fauna as well as flora and the establishment of Environment Brigades and Afforestation Brigades (the afforestation and development of degraded wastelands in India was taken up on a massive scale under his stewardship); enunciated global concepts on Environmental Tariffs and conceptualised Global Emission Quotas; chief spokesman for the developing countries at the UNCED in Rio De Janeiro in 1992: During his tenure as Minister of State, textiles, the country touched new heights in production and export of cotton: the New Textile Policy was successfully launched. As Commerce and Industry Minister of India, he enunicated India`s first comprehensive Foreign Trade Policy in 2004, laying out a coherent roadmap with twin focus on exports as well as employment. He was sucessful in tripling India`s foreign trade wtihin this period and engineering a seven-fold increase in FDI inflow to India. Significant strides were made in the areas of intellectural Property and industrial Design.SEZ Act was enacted with his initiative. His firm grasp of economic issues and consummate diplomatic skills were evident in the World Trade Organisation negotiations, where he emerged as one of the chief architects of the G-20 adn G-33 Alliances and the NAMA 11. The WTO Ministerial Meeting at Hong Kong in 2005 was marked by his championship of the cause of developing countries. , (i) Board of Governors, Institute of Management Technology, Ghaziabad; (ii) Lajpatrai Smarak Mahavidyalaya Samiti, Ghaziabad; , Centre for Advanced Education, Nagpur;served on , Housing and Urban Development Corporation (HUDCO); ; (i) National Colliery Workers Federation; (ii) Bharat Yuvak Samaj; (i) FDI personality of the year 2007 for Asia and world; (ii) National Colliery Workers Federation; and (iii) Bharat Yuvak Samaj; Joined Indian National Congress, 1968; , Indian National Congress; ,Congress Working Committee, September 2002-July 2004","Present Address":"\n1, Tuglak Road,\nNew Delhi - 110 011\nTels. (011) 23063495, 23061162 (O), 23792233, 23792234 (R) Fax: (011) 23062089 (O) 23792236 (R)\nParliament Address: Room No. 7, Parliament House,\nNew Delhi - 110001\nTels. (011) 23793064, 23034253\n","Email Address :":"Minister-mud@nic.in","Name":"Kamal Nath,Shri","Marital Status":"Married","Countries Visited":"Widely travelled (i) Indian Delegation to U.N., 1982, 1983; (ii) NAM Summit, 1983; (iii) I.P.U. Conferences, Nicaragua, 1987, Guatemala, 1988 and Cyprus, 1990; to (i) Tokyo, 1989; (ii) Cyprus, and (iii) U.K., 1990; Indian Delegation to the World Conference in Paris, 1991; the UNEP Governing Council meeting in Nairobi, the PREPCOM IV discussion in New York and Kuala Lampur Conference, all in 1992; hosted the SAARC Environment Ministers` Conference in New Delhi and emerged as one of the chief spokesmen for developing countries at the UNCED in Rio de Janeiro in June 1992; Leader, National delegations to Finland, Sweden, Germany, Japan, Singapore, Dubai and UK and also to UNCTAD and UNEP and World Economic Forum meetings at Davos, Switzerland; WTO Ministerial\/mini-Ministerial and other related meetings around the world.","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/175.jpg","Positions Held":"\n1980\nElected to 7th Lok Sabha\n\n1985\nRe-elected to 8th Lok Sabha (2nd term)\n\n1989\nRe-elected to 9th Lok Sabha (3rd term)\n\n1991\nRe-elected to 10th Lok Sabha (4th term)\n\n1991-95\nUnion Minister of State, Environment and Forests (Independent Charge)\n\n1995-96\nUnion Minister of State, Textiles (Independent Charge)\n\n1998\nRe-elected to 12th Lok Sabha (5th term)\n\n1998-99\nMember, Committee on Petroleum and Chemicals\nMember, Committee on Members of Parliament Local Area Development Scheme\nMember, Consultative Committee, Ministry of Power\n\n1999\nRe-elected to 13th Lok Sabha (6th term)\n\n1999-2000\nMember, Committee on Finance\n\n2000-2004\nMember, Consultative Committee, Ministry of Mines and Minerals\n\n2001-2004\nGeneral Secretary, Indian National Congress\n\n2004\nRe-elected to 14th Lok Sabha( 7th term)\n\n23 May 2004 - 2009\nUnion Cabinet Minister, Commerce & Industry\n\n2009\nRe-elected to 15th Lok Sabha (8th term)\n\n2009 - 18 Jan 2011\nUnion Cabinet Minister, Road Transport and Highways\n\n19 Jan 2011 onwards\nUnion Cabinet Minister, Urban Development\n\n28 Oct. 2012 onwards\nUnion Cabinet Minister, Parliamentary Affairs\n","Permanent Address":"\nVill. Shikarpur, P.O. Linga,\nDistt. Chhindwara - 480 001, Madhya Pradesh\nTelefax.(07162) 242233\n\n\n\n","Father's Name":"Late Shri Mahendra Nath","Spouse's Name":"Smt. Alka Nath"}