{"Place of Birth":"Agarpara, Distt. Bhadrak (Orissa)","Social And Cultural Activities":"Organising farmers through Pragati Orissa Krushak Parishad; Chairman, Prajatantra Prachar Samiti the pioneering house of culture in Orissa; Managing Trustee, HKM Foundation; and Chairman Swadhinata Sangrami Sadan Trust","No.of Daughters":"1","Mother's Name":"Smt. Subhadra Mahtab","Party Name":"Biju Janata Dal(BJD)","Profession":"Journalist Writer","Date of Marriage":"26 Apr 1982","Favourite Pastime and Recreation":"Reading, writing and travelling","Literary Artistic & Scientific Accomplishments":"Organising literary and cultural meetings at Cuttack, Bhubaneswar, Sambalpur through Prajatantra Prachar Samiti, Bisuv Milan and Basant Milan, Indira Gandhi Memorial Library, Bhubaneswar and Subhadra Mahtab Library, Puri","Constituency":"Cuttack (Odisha )","Special Interests":"Cultural and literary activities, rural development and international understanding","Date of Birth":"08 Sep 1957","Educational Qualifications":"M.A. (English) Educated at Utkal University, Orissa","No. of Sons":"1","Other Information":"Actively participated in the All India Freedom Fighters Samiti; Head, Youth Wing of All India Freedom Fighters Samiti; and Chief Whip, Biju Janata Dal Parliamentary Party, 2004;","Present Address":"\nAB-94, Shahjahan Road,\nNew Delhi - 110 011\nTels. (011) 23782589, 23782742, 9868180308 (M) Fax: 23070179\n\n\n\n","Email Address :":"bmahtab@sansad.nic.in","Name":"Mahtab,Shri Bhartruhari","Marital Status":"Married","Countries Visited":"Widely travelled; attended UN Summits at Copenhagen in Denmark and Rome in Italy; and 50th Anniversary of UN at New York in U.S.A.; visited U.S.A. through USIS; accompanied Prime Minister during his visit to Iran, Russia, Senegal, Tunisia and Venezuela; attended IXth and XIth NAM Conferences at Belgrade in Yugoslavia in 1989 and Cartegena in Columbia in 1995; and attended 52nd UNGA (United Nations General Assembly) in October 1998 as unofficial Member for two weeks representing Indian Mission in U.N.; visited Mexico as Member of Indian Parliamentary Delegation in May 2001; attended special session of UN for Children, as a member of Indian Parliamentary Delegation in May 2002; also attended 56th, 57th and 58th UN General Assembly as an unofficial delegate for two weeks representing Indian Mission in United Nations in October 2002, October 2003 and November 2004 respectively; participated in Commonwealth Parliamentary Union Workshop on \"Right to Information\" at Ghana in July 2004; attended CPU at Fiji in Sept. 2007 as Indian Parliamentary Delegate; and attended IPU in Zeneva, Sept. 2008 as Indian Delegate; attended the 64th UNGA as an unofficial Indian delegate representing Indian Mission in United Nations; in Oct. 2009; led Indian Parliamentary Delegation to Dhaka to attend CPU-World Bank Institute sponsored Role of Public Accounts Committee in SAARC Countries in Nov. 2009; attended Climate Change Summit as Indian Delegate at Copenhagen in Dec. 2009","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/225.jpg","Positions Held":"\n1998\nElected to 12th Lok Sabha\n\n1998-99\nMember, Committee of Privileges\nMember, Committee on External Affairs\nMember, Central Advisory Board of Education\nMember, Consultative Committee, Ministry of Tourism\nMember, Joint Parliamentary Committee on the functioning of Wakf Boards\n\n1999\nRe-elected to 13th Lok Sabha (2nd term)\n\n1999-2004\nMember, Committee of Privileges\nMember, Public Accounts Committee Member, Committee on Commerece Member, Committee on Labour\nMember, Committee on Communications and Information Technology\nMember, Joint Committee on the Central Vigilance Commission Bill, 1999\n\n2000-2004\nMember, Consultative Committee, Ministry of Agriculture\n\n2004\nRe-elected to 14th Lok Sabha( 3rd term)\nMember, Standing Committee on Communication and Information Technology\n\n2004-2005\nMember, Committee on Estimates\nMember, Consultative Committee, Ministry of Information and Broadcasting and Ministry of Culture\n\n5 Aug. 2007\nMember, Standing Committee on Finance\n\n2006-2009\nMember, Committee on Public Accounts\n\n1 May 2008\nMember, Committee on Public Accounts\nMember, Consultative Committee Information & Broadcasting\nSpecial Invitee, Consultative Committee Panchayatiraj\nMember, Youth Affairs & Sports and Development of North Eastern Region\n\n2009\nRe-elected to 15th Lok Sabha (4th term)\n\n6 Aug. 2009\nMember, Committee on Public Accounts\n\n31 Aug. 2009\nMember, Consultative Committee, Ministry of Environment & Forests\nMember, Committee on Finance\n\n1 May 2010\nMember, Committee on Public Accounts\nVice-President, India-Mexico Parliamentary Friendship Group\nVice President, India-Cyprus Parliamentary Friendhip Group\nMember, India-Botswana Parliamentary Friendship Group\nMember, Parliamentary Forum on Global Warming and Climate change\n","Permanent Address":"\nBeharibagh, Chandni Chowk,\nCuttack - 753 002, Orissa\nTels. (0671) 2507568 (O), 2508003(R) Fax: (0671) 2508001\n\n\n\n","Father's Name":"Dr. Harekrushna Mahtab","Spouse's Name":"Smt. Mahasweta Mahtab"}