{"Place of Birth":"Bhawanipatna, Distt. Kalahandi (Orissa)","Sports and Clubs":"Badminton, swimming, long walks, cycling, encouraging sports amongst the students and youths, providing help and guidance to youth clubs","Social And Cultural Activities":"As Chairman, Green Kalahandi, engaged in promoting tribals rights and lifestyles, ecosystems and livelihoods; as patron of several development organizations and community based organizations, promoting empowerment of the disadvantaged, gender equity and social development; also promoting of Oriya culture mainly folk dance, and local customs that build social capital; as chairman of All India Chhatra Sangharsh Vahini, has been crusading for the social and democratic rights of students","Mother's Name":"Late Smt. Bilasha Das","Party Name":"Indian National Congress(INC)","Profession":"Social Worker Advocate Journalist","Date of Marriage":"29 Nov 1987","Favourite Pastime and Recreation":"Singing patriotic songs, listening to classical music, staying and socializing with villagers, reading\/watching episodes of Bhagvat Gita and spending time with friends","Literary Artistic & Scientific Accomplishments":"Wrote articles on poverty, hunger, economic disparity and land reforms published in leading newspapers at National and State level in Hindi, English and Oriya. Wrote \"let us talk politics\" in Congress Sandesh; several mimeographed articles, and booklets on the ecosystem, mining and displacement of tribals in Kalahandi","Constituency":"Kalahandi (Odisha )","Special Interests":"Minute study of rural India with special emphasis on Kalahandi; building contacts and partnership with all those engaged in grassroots field activities like environmental issues","Date of Birth":"26 Nov 1958","Educational Qualifications":"B.A., LL.B. Educated at Government College, Bhawanipatna, Kalahandi, Orissa and L. R. Law College, Sambalpur, Orissa","No. of Sons":"2","Other Information":"Bennett and Coleman Employee Association, 1989-90; led a 4000 km. padyatra and cycle yatras to awaken the masses throughout the states of Orissa, Chhattisgarh and Madhya Pradesh on issues concerning the youth, farmers, tribals, unemployment, social unrest, environment and wasteland management; leading role played in the successful distribution of land to landless in Bodh Gaya; highlighted the facts related to the 1985 famine at Kalahandi in the Assembly; ensured national and international attention on the issue and fought for the alleviation of the situation; also engaged in preserving the life and culture of the Dongaria tribe of the Niyamgiri hills (Kalahandi) which is on the verge of extinction; engaged in promoting environmental and livelihood security of the people theatened by displacement.","Present Address":"\n5, Mahadev Road,\nNew Delhi - 110 001\nTels. (011) 23721119 9868656472, 9013180248 (M) Fax. (011) 23721119\n\n\n\n","Email Address :":"b-chd@yahoo.com","Name":"Das,Shri Bhakta Charan","Marital Status":"Married","Countries Visited":"Widelly travelled","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/3264.jpg","Positions Held":"\n1985-1989\nMember, Orissa Legislative Assembly\nMember, Committee on Scheduled Castes and Scheduled Tribes, Orissa Legislative Assembly\n\n1989\nElected to 9th Lok Sabha\n\n1989-1990\nMember, Consultative Committee, Ministry of Steel\n\n1990\nDeputy Minister for Sports and Youth Affairs\n\n1990-1991\nUnion Minister of State, Railways\n\n1996\nRe-elected to 11th Lok Sabha (2nd term)\n\n1996-1998\nMember, Standing Committee on Mines\n\n2009\nRe-elected to 15th Lok Sabha (3rd term)\n\n1 May 2009\nMember, Committee on Finance\n\n31 Aug. 2009\nMember, Committee on Estimates\nMember, Consultative Committee, Ministry of Environment and Forest\nMember, Central Employment Guarantee Council\n\n9 Jun. 2013\nMember, House Committee\n","Permanent Address":"\nAt & P.O. Badapada, Bhawanipatna,\nDistt. Kalahandi, Orissa\nTels. (06670) 231678, 9437023456 (M) Fax.(06670) 235678\n\n\n\n","Father's Name":"Shri Dibakar Das","Spouse's Name":"Smt. Sunanda Das"}