{"Place of Birth":"Pipaldi, Distt. Vadodara (Gujarat)","Social And Cultural Activities":"Associated with various developmental activities for the upliftment of the weaker sections in Gujarat and with tribal development programmes and cultural dance, drama, music and arts activities","Sports and Clubs":"Member, Fine Arts, Film Club, Vadodara, Gujarat","Mother's Name":"Smt. Dhagdiben Rathwa","Party Name":"Bharatiya Janata Party(BJP)","Favourite Pastime and Recreation":"Tribal Painting","Special Interests":"Painting, Photography and Print making \"PITHORA\" Painting - the traditional idom of Adivasi Land.","Other Information":"Gallery artist; active in college activities; participated in, (i) various developmental activities in and around Anand Niketan Ashram; (ii) All India Khet Parishad activities; and (iii) Art exhibitions at regional, national and international levels; was on art teacher in Jeevan Sadhana High School, Baroda, 1977–81; devoted to Print Making group of Gallery Artists-Darbar Hall Museum, Junagarh, Gujarat, 1981-82","Email Address :":"ramsinhrathwa@yahoo.co.in","Present Address":"\n48, South Avenue,\nNew Delhi - 110 011\nTels. 9013180464 (M)\n\n\n\n","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/364.jpg","Permanent Address":"\n(i) 192 B, Amit Nagar Society, VIP Road\nKarelibaug, Vadodara, Gujarat - 390018\nTels. (0265) 2484111, 09909014490 (M) Fax. (0265) 2492558\n(ii) At. & Post. Pipaldi, Tal. Kawant,\nDistt. Vadodara, Gujarat\n\n","Spouse's Name":"Smt. Sudha Ben Rathwa","No.of Daughters":"1","Date of Marriage":"29 May 1981","Profession":"Political and Social Worker Artist Agriculturist Businessperson","Constituency":"Chhota Udaipur (ST) (Gujarat )","Literary Artistic & Scientific Accomplishments":"Awarded certificate of merit by the Association of Working Artists in 1984; held Art exhibitions at regional, national and international levels; the paintings have formed a part of the collectional heritage of National Lalitkala Academy, Delhi; Government Museum and Art Gallery Chandigarh; Birla Lalitkala Academy, New Delhi; Lalitkala Academy, Bangalore; Karnataka State Lalit Kala Acadamy Bangalore; All India Fine Arts and Craft Society, New Delhi; Bombay Art Society; Manipur State Lalit Kala Acadamy and Graphic workshops organised by Gujarat State Lalit Kala Academy and faculty of Fine Arts M.S. University, Vadodara","Date of Birth":"01 Jun 1951","No. of Sons":"1","Educational Qualifications":"S.S.C., Diploma in Painting, Post-Diploma in Graphics; short-term training course in Museology Educated at Kawant English School, Chhota Udaipur, Gujarat, Faculty of Fine Arts, M.S. University, Vadodara, Gujarat; and National Museum, New Delhi","Name":"Rathwa,Shri Ramsinh Patalyabhai","Marital Status":"Married","Countries Visited":"Denmark, Egypt, Hong Kong, Israel, Italy, Japan (as a member of Parliamentary Delegation), South Korea, Singapore and Thailand","Positions Held":"\n1982-94\nMember, Rajya Sabha (two terms)\n\n1982-84\nMember, Consultative Committee, Ministry of Agriculture and Rural Development\n\n1984-1986\nMember, Consultative Committee on HRD\n\n1986-88\nMember, Consultative Committee on Subordinate Legislation\nMember, Consultative Committee on Ministry of Petroleum and Natural Gas\n\n1988-1990\nMember, Consultative Committee, Ministry of Defence\n\n1990-92\nMember, Railway Convention Committee\n\n1992-94\nMember, Consultative Committee, Department of Revenue\n\n1999\nElected to 13th Lok Sabha\n\n1999-2000\nMember, Committee on Finance\n\n2000-2004\nMember, Consultative Committee, Ministry of Finance\n\n2009\nRe-elected to 15th Lok Sabha (2nd term)\n\n31 Aug. 2009\nMember, Committee on Industry\nMember, Consultative Committee, Ministry of Environment and Forests\nMember, Standing Committee, Ministry of Industry\n\n15 Mar. 2010\nMember, Railway Convention Committee\n","Father's Name":"Shri Patalyabhai Rathwa"}