{"Place of Birth":"Nellore (Andhra Pradesh)","Sports and Clubs":"Playing football and cricket","Social And Cultural Activities":"Founded school, Junior Degree Colleges\/and undertook construction of school buildings in Ongole, Nellore and Prakasham Districts in Andhra Pradesh, particularly in villages; takes keen interest in use of technology for the welfare of mankind; took part in various activities aimed at spread of literacy and political awakening through personal interactions with masses in villages; Construction of Community Halls, Community Centres and Marriage Halls; supply of drinking water through tankers in villages; providing ambulances for health purposes, orgzanising health centres; necessary assistance to the sick and destitute; provided relief and rehabilation to Tsunami victims and of natural disasters like floods, rains etc. in Andhra Pradesh; organising prgrammes and health camps at ward level for the upliftment of the oppressed and depressed sections of society and to secure social justice to them by promoting socio-cultural activities","Mother's Name":"Late Smt. Magunta Kousalyamma","Party Name":"Indian National Congress(INC)","Profession":"Agriculturist Industrialist","Date of Marriage":"30 Apr 1975","Favourite Pastime and Recreation":"Watching national and international news on television for latest development and listening to music","Constituency":"Ongole (Andhra Pradesh )","Special Interests":"Identification of immediate needs and long term requirement of the public in general and getting schemes prepared with the help of technical people through our resources in addition to Govt. Schemes; have been monitoring State Government\/Govt. of India Schemes and get them implemented to ensure that the benefit reaches to all section of the people in the Consitutency; arranging State level conferences and meetings relating to Panchayati Raj, Party and leading several delegations to solve and mitigate the problems of the people particularly of Tabacco farmers; taken keen interest in the establishment of airport at Ongole; modernization of Bucklingam Canal flowing through Ongole; laying of new railway lines between Nadikudi and Sri Kalahasti and Ongole-Donakonda and provision of additonal bypass to Ongole Town while 6-laning of NH-5.","Date of Birth":"15 Oct 1953","Educational Qualifications":"B.Com Educated at V.R. College, Nellore,Andhra Pradesh","No. of Sons":"2","Present Address":"\nAB-18, Mathura Road,\nNew Delhi - 110 001\nTels. (011) 23782089, 23782199, 9868180614 (M) Fax.(011) 23782089\n\n\n\n","Email Address :":"reddy.magunta@sansad.nic.in","Name":"Reddy,Shri Magunta Sreenivasulu","Marital Status":"Married","Countries Visited":"Widely travelled","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/3907.jpg","Positions Held":"\n1998\nElected to 12th Lok Sabha\n\n1998 - 1999\nMember, Committee on Finance\nMember, Joint Committee on Offices of Profit\nMember, Consultative Committee, Ministry of Finance - Special Invitee\nMember, Consultative Committee, Ministry of Railways\n\n2004\nRe-elected to 14th Lok Sabha (2nd term)\nMember, Committee on Public Accounts\nMember, Consultative Committee, Minsitry of Finance\nMember, Committee on Members of Parliament Local Area Development Scheme (MPLADS)\nMember, Standing Committee on Finance\n\n2009\nRe-elected to 15th Lok Sabha (3rd term)\n\n6 Aug. 2009\nMember, Committee on Estimates\n\n31 Aug. 2009\nMember, Committee on Finance\nMember, Consultative Committee for Commerce & Industry\nMember, Consultative Committee, Ministry of Finance - Special Invitee\n\n1 May 2010\nMember, Committee on Estimates\n","Permanent Address":"\n37-1-419 (10), Ram Nagar, 2 Lane,\nOngole - 523 001 Andhra Pradesh\nTels: (08592) 231234,235855, Fax (08592) 228999\n\n\n\n","Father's Name":"Late Shri Magunta Raghava Reddy","Spouse's Name":"Smt. Geeta Latha Magunta"}