{"Place of Birth":"Hisar (Haryana)","Social And Cultural Activities":"Single handed fought for the dignified display of the National-Flag as a symbol of honour and pride including display of the tri-colour on clothes; Zealous about ushering honesty into public life and eradicating corruption, unemployment and poverty; worked for the ban of smoking in the Central Hall of Parliament House; worked for the development of Kurukshetra and for the development of sports in the country; Instrumental (i) in getting permission for flying the National flags on monumental flagpoles over 100 ft high during night hours too; and (ii) amending Rule 349 (XIV) of the Rules of Procedure and Conduct of Business in Lok Sabha allowing Hon. Members to wear the National Flag in the form of lapel pin\/badge.","Sports and Clubs":"Former National Champion and present National record holder in skeet shooting; won silver medal in SAF games,Pakistan, 2004; Gold at the Open Shooting Championship, Singapore, 2004; Captain of Jindal Steel & Power Polo team; winner of Indian Open 2003 and 2004, an event of highest level of polo played in India; President, Equestrian Association of Chhattisgarh; Two silver Medals at the 48th National Shooting Championship, Indore 2004; Silver medal at the 50th National Shooting Championship, New Delhi, December 2006; Gold Medal at the V Sardar Sajjan Singh Sethi Memorial Master Shooting Competition, Jaipur 2007","Mother's Name":"Smt. Savitri Devi Jindal","Party Name":"Indian National Congress(INC)","Favourite Pastime and Recreation":"Playing polo, horse riding, shooting, reading, walking, exercise and yoga","Special Interests":"Promoting respectful display of National Flag which symbolises national honour and pride; bringing honesty into public life and eradicating corruption and red tapism; achieving population stabilization through education for all especially women","Other Information":"Executive Committee on Constitution Club; , O.P. Jindal Global University, Sonepat (Haryana); Ind-UK Parliamentary Friendship Group; (ii) Indo-Yemen Parliamentary Friendship Group; and (iii) Young Presidents Organisation; , IPA (Indain Polo Associaton) Consitutional Club; (i) The Commonwealth Parliamentary Association Seminar, May 2006; (ii) Indo-US forum of Parliamentary Leadership Programme, Yale University, USA, October 2007; and (iii) UNCTAD XII Conference, Accra, April 2008; UN General Assembly on Global Warming and Private Investment, June 2009 (i) Jindal Steel & Power Ltd. (JSPL), during the five year period 2005 to 2009, as the 2nd largest value Creator in the world and the only company from India to be included in the Top Ten 2010 Value Creators global rankings released by leading global management consultin firm; and (ii) The Boston Consulting group (BCG), ranked 1st amongst the global and mining companies during this period","Email Address :":"naveen.jindal@sansad.nic.in","Present Address":"\n171, South Avenue,\nNew Delhi - 110 011\nTels. (011) 23012253, 23795299 9868180595 (M) Fax. (011) 23012213\n\n\n\n","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4041.jpg","Permanent Address":"\nJindal House, Mohan Nagar, Pipli Road,\nKurukshetra - 136 118, Haryana\nTelefax. (01744) 222223, 223400\n\n\n\n","Spouse's Name":"Smt. Shallu Jindal","No.of Daughters":"1","Date of Marriage":"28 May 1994","Profession":"Industrialist Sportsperson Philanthropist and Social Worker Pilot","Constituency":"Kurukshetra (Haryana )","Literary Artistic & Scientific Accomplishments":"Pioneered the manufacture of the world`s longest rail (121 meters long); installed beam blank caster and H-beam (Universal) rolling mill first time in India for providing large sized parallel of large beams; manufacture of widest plates in the form of coils and established the country`s first eco-friendly Direct Reduced Iron (DRI) plant","Date of Birth":"09 Mar 1970","No. of Sons":"1","Educational Qualifications":"B.Com. (Hons.), MBA Educated at Hansraj College, University of Delhi, Delhi and University of Texas, Dallas, U.S.A.","Name":"Jindal,Shri Naveen","Marital Status":"Married","Countries Visited":"Widely travelled","Positions Held":"\n2004\nElected to 14th Lok Sabha\n\n5 Aug. 2004\nMember, Committee on Home Affairs\nConvenor, Home Sub-Committee on Modernisation of Prison Administration\nConvenor, Parliamentary Forum on Youth\nMember, Consultative Committee, Ministry of Defence\n\n16 Dec. 2004\nMember, Committee on Public Accounts\n\n2009\nRe-elected to 15th Lok Sabha (2nd term)\n\n31 Aug. 2009\nMember, Standing Committee on Home Affairs\nMember, Consultative Committee, Ministry of Defence\n\n21 Jan. 2010\nMember - Convenor, Parliamentary Forum on Children\n\n4 May 2010\nSpecial Invitee, Consultative Committee, Ministry of Road, Transport & Highways\nSpecial Invitee, Consultative Committee, Ministry of Civil Aviation\n\n5 May 2010\nMember, Committee on Public Accounts\n","Father's Name":"Late Shri Om Prakash Jindal"}