{"Place of Birth":"Moirangjel Hingol, Moidangpok, Imphal West (Manipu","Social And Cultural Activities":"(i) Imphal West Students` Club, (IWSC), Khumbong; (ii) United Sports and Cultural Association (USCA), Manipur; (iii) Hyderabad Manipuri Students Association, Hyderabad; (iv) Manipurgi Ngamkhei Kanba Lup NH-53( Mankal) formed during the Great June uprising, 2001 (Manipur); (v) Parents Teachers Association, Jawahar Navodaya Vidyalaya, Imphal West, Khumbong; (i) Western Development Organisation ,Imphal West; (ii) Guwahati Manipuri Students Association; (iii) All Manipuri Youths (Assam, Tripura & Manipur) Conference, Gauhati, 1968, which had formed the then PAN Manipur Youth League (PANMYL); (iv) All Manipur College Teachers Association ; (i) National Executive Committee, All India Federation of University and College Teachers` Organisation (AIFUCTO), The Manipur Debating Society; (i) Koloipan High School, Khubong; and (ii) Loyalam Art and Culture Institute, Khumburg; Secretary, Western Girls` High School, Awangkhunou","Sports and Clubs":"Indigenous games of Manipur, viz. Mukna, Kang, Khong Kangjei and Polo (Sagol Kangjei), Tennis","Mother's Name":"Late Smt. Thokchom Thambalmacha Devi","Party Name":"Indian National Congress(INC)","Favourite Pastime and Recreation":"Reading, watching T.V., films, philately and making pen friends","Special Interests":"Improving the standard of primary and secondary education; research and development for higher education; popularisation of science and fighting superstitions; improvement of womens` status","Other Information":"Actively participated in the students` movement and later in the teachers` movement; fought for the territorial integrity of Manipur ; participated in Great June uprising 2001, Manipur, under the banner of United Committee, Manipur (UCM) and Manipurgi Ngamkhei Kanba Lup NH-53; Lecturer in Maths, D.M. College, Imphal, 1971-72; Reader and Head of the Department, Maths, Imphal College, Imphal, till 2002; Head Examiner, Mathematics under BSEM, CHSEM and M.U; Director, (i) The Manipur State Cooperative Bank Ltd; (ii) The Manipur State Wholesale Consumer Cooperative Society Ltd.; practised Law for a short period; retired voluntarily on 5 January, 2002 from the Government Service; as Minister of Higher and Technical Education, Manipur, constituted Manipur State Higher Education Commission and handed over the management of Government College of Technology to Manipur College of Technology Society for better management of the institution; Member (i) Executive Council, IISC, 2004-09; and (ii) Court of (NEHU) Shillong, 2004-09; , All India Federation of University & College Retired Teacher`s Organisation","Email Address :":"meinya@sansad.nic.in","Present Address":"\nA-3, M.S.Flats, B.K.S. Marg,\nNew Delhi - 110 001\nTels. (011) 23711696 9868180295 (M) Fax. (011) 23766499\n\n\n\n","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4055.jpg","Permanent Address":"\nJoypurkhul Khumbong Bazar\nP.O. Langjing, Imphal West Manipur - 795 113\nTels. (0385) 2569205, 2051306 09436021818 (M) Fax. (0385) 2569205\n\n\n\n","Spouse's Name":"Smt. Thokchom Sorojini Devi","No.of Daughters":"1","Date of Marriage":"14 Feb 1984","Profession":"Teacher Advocate Social Worker Scientist","Constituency":"Inner Manipur (Manipur )","Literary Artistic & Scientific Accomplishments":"Guided one Ph.D. student under Manipur University; (i) Indian Astronomical Society, Calcutta; (ii)The Astronomical Society of India, Hyderabad; Manipur Science Communicators Association; Published a number of scientific papers in national and international Journals and attended national and international science seminars","Date of Birth":"12 Oct 1945","No. of Sons":"1","Educational Qualifications":"M.Sc., LL.B., M. Phil, Ph. D. Educated at D.M. College, Imphal, Gauhati University, Guwahati and Osmania University, Hyderabad, Andhra Pradesh","Name":"Meinya,Dr. Thokchom","Marital Status":"Married","Countries Visited":"Widely travelled","Positions Held":"\n2002-2004\nMember, Manipur Legislative Assembly\n\n2002-2003\nMinister of State (Independent Charge), Higher & Technical Education, Manipur\n\n2003-2004\nCabinet Minister, Higher & Technical Education, Govt. of Manipur\n\n2004-09\nElected to 14th Lok Sabha\nMember, Committee on Human Resource Development\nMember, Consultative Committee, Ministry of External Affairs\nConvener, Miscellaneous States and Union Territories, Congress Parliamentary Party\nMember, Library Committee\n\n2009\nRe-elected to 15th Lok Sabha (2nd term)\n\n29 Jun. 2009\nMember, Business Advisory Committee\n\n31 August 2009\nMember, Committee on Petroleum and Natural Gas\nMember, Consultative Committee, Ministry of Home Affairs\nMember, North Eastern Hill University (NEHU) Court\nMember, Governing Council, NEIGHRIMS, Shillong\nMember, Executive Committee, Congress Party in Parliament\nConvenor, West Bengal & North Eastern States (except Assam) , Congress Party in Parliament\n","Father's Name":"Late Shri Thokchom Tarpan Singh"}