{"Place of Birth":"Sasansima, Distt. Jajpur (Orissa)","Sports and Clubs":"Promotes rural sports through village Sports and Youth Association","Social And Cultural Activities":"Has led many student and youth movements in Orissa as an eminent student leader; as the founder General Secretary of Ambedkar-Lohia Vichar Manch, Orissa, he was in the front line of social justice movements against untouchability, caste oppression and exploitation of the poor and down-trodden; he has also been striving for strengthening the human rights movement besides promoting the cause of socio-cultural unity and secular traditions; has been pioneer in abolishing the inhuman practice of slaughter of animals in the name of religion; he was awarded by NISWAS, Orissa, Bhubaneswar in 2001 for best social work; also received Citation and Award by Jana Chetana Parishad , Orissa, Bhubaneswar in the year 2002 and from many institutions and organisations","No.of Daughters":"1","Mother's Name":"Late Gelharani Jena","Party Name":"Biju Janata Dal(BJD)","Profession":"Social Worker Publisher Agriculturist","Date of Marriage":"01 Jan 1990","Favourite Pastime and Recreation":"Loves to see films, theatre and street plays on progressive issues; listens to songs of Tagore, Kazi Nazrul Islam and reads the poems and novels of Utkalmoni Gopabandhu, Fakir Mohan and writing of Bharat Ratna Baba Saheb Dr. Ambedkar","Literary Artistic & Scientific Accomplishments":"Articles on Socio-Economic Change, Human Rights issues and life of freedom fighters and revolutionaries; popularisation of science, environment and agriculture","Constituency":"Jajpur (SC) (Odisha )","Special Interests":"Planning, co-ordination and activism for alleviation of poverty and ensuring socio-economic justice for poor and down-trodden; being a man of the masses, he aptly identifies himself with rural culture, theatre, drama, jatras etc; believes in Gramin Swaviman and socio-economic development of the villages; as an avid reader, takes special interest in reading philosophies, history, biographies and books related to socio-economic and environmental changes","Date of Birth":"14 Jul 1957","Educational Qualifications":"M.A. (Sociology) Educated at Kendrapara College, Kendrapara and P.G.Deptt. of Sociology, Utkal University, Vani Vihar, Bhubaneswar, Orissa","Other Information":",(i) Indian Parliamentary Group, and (ii) Scheduled Castes Welfare Advisory Board, Government of Orissa; was elected the President of Utkal University Student`s Union, Vani Vihar, Orissa, Bhubaneswar in 1982 -1983; is the only dalit to occupy this highest post in 60 years of the University`s history; , Leader, Secretary, All India Democratic Students Organisation, Orissa State Unit, 1977-91;, All Orissa Student`s Action Committee, 1981and 1984 and led these two historic student movements; organised relief camps for the flood victims and cyclone victims in 1982, 1992, 2001 and 2002 and Super Cyclone of Orissa in 1999; of the movements for Secular, Scientific and Democratic Education and Universalisation of Primary Education in the Year 1986; One of the convenors, Committee for Protection of Democratic Rights Secularism(C.P.D.R.S.) on Human Rights Issues in the 1984; organised a State Level Social Justice Convention for SCs, STs, Backwards and Minorities in the year 1988; led state level cycle rally from State Capital Bhubaneswar to seashore of Baliapal, against Missile Base at Baliapal, Orissa, in 1988; Organised Communal Harmony Convention after Gujarat massacre in the year 2003; , Orissa Association for the Blind 2004 onwards; participated in (i) Dalit Swadhikar Rally (Kolkata to Mumbai) organised by NCDHR in 2003 and (ii) 4th World Social Forum against Globalisation, War and Racism at Mumbai on 2-9 January, 2004; of ` Paribesh Suraksha Abhiyan` to create awareness and protect environment since 2007; founderof `Gargi Mohotsva` a festival to protect hills, forests etc.; ` Santha Bhim Bhoi Pathagar`; ` Project Swaraj` an NGO involved in the field of drug deaddiction and empowerment of women","Present Address":"\n124-126, North Avenue,\nNew Delhi -110 001\nTels. (011) 23093518, 23093309 9868180198 (M)\n\n\n\n","Name":"Jena,Shri Mohan","Marital Status":"Married","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4140.jpg","Positions Held":"\n1992 - 1994\nGeneral Secretary, Yuva Janata Dal, Orissa\n\n1994 - 1998\nSecretary, Janata Dal, Orissa State Unit\n\n2004\nState Executive Body Member, BJD, Orissa\n\n2004\nElected to 14th Lok Sabha\nMember, Joint Committee on Offices of Profit\nMember, Committee on Government Assurances\nMember, Committee on Rural Development\nMember, Parliamentary Forum for Scheduled Castes & Scheduled Tribes\nMember, Hindi Salahakar Samiti, Ministry of Power\nMember, Consultative Committee, Ministry of Social Justice & Empowerment\n\n5 Aug. 2007 onwards\nMember, Standing Committee on Energy\n\n2009\nRe-elected to 15th Lok Sabha (2nd term)\n\n31 Aug. 2009\nMember, Committee on Social Justice and Empowerment\n\n23 Sep. 2009\nMember, Committee on Government Assurances\nMember, Consultsative Committee on Water Resources\nMember, Standing Committee on Social Justice and Empowerment\nMember, Committee on Welfare of Scheduled Castes and Scheduled Tribes\nMember, Hindi Salahkar Samiti\n","Permanent Address":"\nAt. Sasansima, P.O. Dhanmandal,\nDistt. Jajpur - 754 024, Orissa\nTels. (06725) 221960, 2421805 (0674) 2588349, Fax. (0674) 2421806 09437066156 (M)\n\n\n\n","Father's Name":"Late Gokuli Jena","Spouse's Name":"Smt. Harapriya Panigrahi"}