{"Place of Birth":"Rajahmundry (Andhra Pradesh)","Sports and Clubs":"Member (i) Nizam Club; (ii) Country Club; and (iii) Constitution Club","Social And Cultural Activities":"Actively Participated in various social, educational and cultural activities; toured through the State of Andhra Pradesh with Shri N.T.R. and A.N.R. for collecting cyclone relief fund for the Deviseema calamity, 1997; organised and participated in Star Nights and contributed the proceeds to the Mother Teresa Cancer Institute and Punjab Police Welfare Fund; established Jayaprada Charitable Trust which has organised eye camps, eye banks, blood donation camps, ortho camps, providing blankets to poor, handicapped and destitute people and arranging group marriages, etc. for the welfare of society; establish Jayaprada Educational Society and Neelaveni Krishna (N.K.) School of Nursing and opening Jayaprada College of Law for the poor student, Rampur","Mother's Name":"Smt. Neelaveni","Party Name":"Samajwadi Party(SP)","Profession":"Film Artist Fim Producer Distributor Social Worker","Date of Marriage":"22 Jun 1986","Favourite Pastime and Recreation":"Music, dance and painting","Literary Artistic & Scientific Accomplishments":"Historical subject Amrapali is most appreciated ballet of her stage performances;learned classical Kuchipudi and Bharatanatyam Dances; recipient of (i) Doctorate from Sri Venkateswara University (A.P.); (ii) Rajiv Gandhi Award; (iii) Filmfare Award (four times); (iv) Lifetime Achievement Award, 2008; (v) Kala Saraswati Award; (vi) Nargis Dutt Gold Medal;(vii) Kinnera Savitri Award, (viii) Shakuntala Kala Rathnam Award; (ix) Ugadi Puraskar, Chennai; (x) Mahila Shaurya Samman; (xi)Uttam Kumar Award; and (xii) Shiromani Award","Constituency":"Rampur (Uttar Pradesh )","Special Interests":"To do charity work through her Charitable Trust for upliftment of poor, sick, handicapped, victimized and destitute people","Date of Birth":"03 Apr 1962","Educational Qualifications":"B.A. Educated at Rajalaxmi Women`s College, Rajahmundry, Andhra Pradesh","Other Information":"A versatile actress, producer, director and exhibitor; started her film career that spanned over two decades and acted in more than 280 films in different languages viz. Telugu, Hindi, Kannada, Bengali, Tamil, Malayalam and Marathi; actively involved in the field of Production and Distribution of Films; produced Bengali film `Shesh Sanghat` ; inspired by the movement of NTR, joined politics in 1994 and since then actively working for social welfare.","Present Address":"\n9, Canning Lane,\nNew Delhi - 110 001\nTel. (011) 23782931\n\n\n\n","Email Address :":"1. jayaprada_999@yahoo.in 2. jp.nahata@sansad.nic.in","Name":"Nahata,Smt. P. Jaya Prada","Marital Status":"Married","Countries Visited":"Widely travelled","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4165.jpg","Positions Held":"\n\n1996-2002\nMember, Rajya Sabha\n\n1996-97\nMember, Committee on Industry\nMember, Committee on External Affairs\nMember, Committe on the Welfare of Scheduled Castes and Scheduled Tribes\nMember, Consultative Committee, Ministry of Information and Broadcasting\n\n2004\nElected to 14th Lok Sabha\n\n2004-09\nMember, Committee on Information Technology\nMember, Committee on Empowerment of Women\nMember,Parliamentary Forum on Water Conservation & Management\n\n2009\nRe-elected to 15th Lok Sabha (2nd term)\n\n31 Aug. 2009\nMember, Committee on Finance\n","Permanent Address":"\nA- 202, Juhu Princes, Juhu Tara Road, Juhu\nMumbai - 400 049, Maharashtra\n\n\n\n\n","Father's Name":"Shri Krishna","Spouse's Name":"Shri Srikant Nahata"}