{"Place of Birth":"Bishnoherpur, Distt. Gonda (Uttar Pradesh)","Sports and Clubs":"Organising volleyball and wrestling competitions; President, Uttar Pradesh Association from 2008 to till date; and Vice President, Wrestling Federation of India from 2008 to till date","Social And Cultural Activities":"Active in social work; set up Nandini Nagar Mahavidyalaya; launched public awareness campaign by taking out “Matra Raksha Rath Yatra” in 1993 against I.S.I. activities in the country; organised a movement against feudal land mafia and facilitated the process of allocation of land on lease basis to the poor and deserving","No.of Daughters":"1","Mother's Name":"Smt. Pyari Devi Singh","Party Name":"Samajwadi Party(SP)","Profession":"Agriculturist Social Worker Musician Sportsperson","Date of Marriage":"11 Jun 1981","Favourite Pastime and Recreation":"Reading books which inspire national sentiments and singing and listening to Bhojpuri songs","Constituency":"Kaiserganj (Uttar Pradesh )","Special Interests":"Social work","Date of Birth":"08 Jan 1957","Educational Qualifications":"M.A., LL.B. Educated at Saket Mahavidyalay, Avadh University, Faizabad, Uttar Pradesh","No. of Sons":"2","Other Information":", (i) Nandini Nagar Mahavidyala, Nawabganj, Gonda; (ii) Nandini Nagar Vidhi Mahavidyalaya, Nawabganj, Gonda; (iii) Nandini Nagar, Mahavidyalaya College of Pharmacy, Nawabganj, Gonda; (iv) Mahila Shikshan Prashikshan Sansthan, Nawabganj, Gonda; (v) Jandamba Sharan Singh Educational Institute, Belsar, Gonda; (vi) Mata Raj Rani Mahavidyalaya, Belsar, Gonda; (vii) Eklavya Mahavidyalaya, Jarwal Road, Bahraich; (viii) Guru Vashishtha Mahavidyalaya, Mankapur, Gonda; (ix) Nandini Nagar Mahavidyalaya group of Institute, Faculty of Engineering and Technology, Nawabganj, Gonda; (x) Nandini Nagar Mahavidyalaya group of Institute, Faculty of Management, Nawaabganj, Gonda; (xi) Shakti Smarak Sansthan, Dulhanpur, Balrampur; (xii) Shakti Smarak Vidhi Sansthan, Dulhanpur, Balrampur; (xiii) Shakti College of Pharmacy, Dulhanpur, Balrampur; (xiv) Saryu Degree College, Colonel Ganj, Gonda; (xv) Saryu Balika Inter College, Colonel Ganj, Gonda; (xvi) Shivalik Mahavidyalaya District Head Quarters, Bhinga, Shravasti; (xvii) Lav Vidyapeeth CBSE, District Headquarters, Bhinga, Shravasti; (xviii) Lakhanlal Sharan Singh Mahavidyalaya, Raghunathpur, Gonda; (xix) Maharaja Balbhadra Singh Raikuar Mahavidyalaya, Payagpur, Bahraich; (xx) Mahakavi Tulsidas Mahavidyalaya, Paraspur, Gonda; (xxi) Raghukul Mahila Vidyapeeth, Civil lines, Gonda; (xxii) Raghukul Vidyapeeth, Civil Lines, Raghukul Mahila Vidyapeeeth, Civil Lines, Gonda; (xxiii) Late Jaidev Singh Inter College, Vishunpur Bairiya, Gonda; (xxiv) Jagmohan Singh Adarsh Kanya Madhyamik Vidyalaya, Karda Wazirganj, Gonda; (xxv) Vipin Bihari Shashi Bhushan Inter College, Bishnoherpur, Gonda; (xxvi) Chandrabhan Singh Muneshwar Singh Inter College, Sakipur, Gonda; (xxvii) Late Chandan Singh Memorial Girls Inter College, Chandpur, Wazirganj, Gonda; (xxviii) Late Awadhran Inter College, Dubaha Bazaar, Gonda; (xxix) Jagdamba Sharan Singh Industrial Training Centre, Ragarganj, Gonda; D.A.V Inter College, Nawabganj, Gonda; (i) Shivsavitri Mahavidyalaya, Sarai Mughal, Rudauli, Faizabad; (ii) Savitri Mahavidyalaya Degree College, Takpura, Darshan Nagar, Faizabad; (iii) Shyam Narayan Urmila Girls Teacher Training College, Sarai Mughal, Rudauli, Faizabad; and (iv) Deepnarayan Singh Mahavidyalaya Tulsipur Balrampur (U.P)","Present Address":"\n14, Mahadev Road,\nNew Delhi - 110 001\nTel. 09868180054 (M)\n\n\n\n","Name":"Singh,Shri Brijbhushan Sharan","Marital Status":"Married","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/438.jpg","Positions Held":"\n1991\nElected to 10th Lok Sabha\nMember, Standing Committee on Science and Technology\nMember, Consultative Committee, Ministry of Railways\n\n1999\nRe-elected to 13th Lok Sabha (2nd term)\n\n1999-2000\nMember, Committee on Railways\nMember, Comittee on Labour\nMember, Public Accounts Committee\n\n2000-2004\nMember, Consultative Committee, Ministry of Railways\n\n2004\nRe-elected to 14th Lok Sabha( 3rd term)\nMember, Committee on Home Affairs\nMember, Public Accounts Committee\nMember, Consultative Committee, Ministry of Defence\n\n5 Aug. 2006\nMember, Committee on Home Affairs\n\n5 Aug. 2007\nMember, Committee on Home Affairs\n\n1 May 2008\nMember, Financial Committee on Estimates\n\n2009\nRe-elected to 15th Lok Sabha (4th term)\n\n6 Aug. 2009\nMember, Committee on Estimates\n\n31 Aug. 2009\nMember, Committee on Human Resource Development\n\n1 May 2010\nMember, Committee on Estimates\n\n9 Jun. 2013\nMember, House Committee\n","Permanent Address":"\nVillage & Post - Bishnoherpur\nDistt. Gonda -208 002 , Uttar Pradesh\nTels. (05260) 274216, 09415109000 (M)\n\n\n\n","Father's Name":"Late Shri Jagdamba Sharan Singh","Spouse's Name":"Smt. Ketki Devi Singh"}