{"Place of Birth":"Akole, Distt. - Ahmedanagar (Maharashtra)","Social And Cultural Activities":"Various development projects carried out at Shirdi Sansthan during his tenure viz., educational complex, Bhakta Niwas and prasadalay, Super Speciality Hospital,Zilla Parishad school building, project regarding water and electricity project, renovation and construction of various buildings, yoga programmes, medical facility for the poor including plastic surgery and artifical limb,eye camp etc.;run MSCIT and I.T.I classes, English Medium Schools and Kanya Vidya Mandir, blessed 100 marriages, and plan to raise to a solar system project with approximate cost of Rs. 16 crores; Active participation in various youth movements and students agitations, established various state government Employees organisations and Tribe Organisation , attempted to resolve difficulties and problem of employees by adorning various posts, various policy decision at state level like postal D.Ed.Scheme, Scholarships, permanent employment of 60 thousand interim employees and participation in various movements for scheduled caste\/tribes","No.of Daughters":"2","Mother's Name":"Smt. Godabai Rajaram Wakchaure","Party Name":"Shiv Sena(SS)","Profession":"Social Worker Agriculturist","Date of Marriage":"24 May 1978","Constituency":"Shirdi (SC) (Maharashtra )","Special Interests":"Yoga, swimming, writing poems, reading spiritual, thoughtful literature","Date of Birth":"04 Jan 1950","Educational Qualifications":"B.Com., B.A., LL.B., D.L.L. & L.W., G.D.C. & A., D.Ed. Educated at Pune University, Ahmednagar, Maharashtra","No. of Sons":"1","Other Information":"An efficient officer on various posts for the last 39 years of Government service, mainly T.P.O., B.D.O.; Deputy Chief Executive Officer Z.P. at Ahmednagar; retired as an Executive Officer of Shri Saibaba Sansthan Trust, Shirdi; O.B.C. Seva Sangha Maharashtra State; (i) All India Scheduled Caste Union for 4 years;and (ii) All India Scheduled Caste\/Tribes Emplyees Welfare Sangh; ; All India Panchayat Parishad; Secretary Caste tribe employees Association Maharashtra State; Acquired awards (i) First Prize Yashwantrao Chavan Bhushan award for development in P. Ahmednagar, 1994; (ii) Student Friend award, 1999; (iv) Social honour award, 2001; (v) awarded a memento for Airport Praise Worthy Performance, 2001-02; (vi) Veer Bharati award in political, educational, commercial, administrative work , 2001-02; (vii) Honoured with Bahumal Karyartha Adarsha maanav, 2003; (viii) Samaaj Gaurav; (ix)Momento for excellent service rendered in integrated child development;and (x)Maharashtra Appreciation Award on the occasion of 57th Independence Day for his excellent services, 2004","Present Address":"\n20, South Avenue,\nNew Delhi - 110 011\nTels. (011) 23793545 9013180054 (M)\n\n\n\n","Email Address :":"(i) br.wakchaure@sansad.nic.in (ii) wakchaurebr@gmail.com","Name":"Wakchaure ,Shri Bhausaheb","Marital Status":"Married","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4385.jpg","Positions Held":"\n2009\nElected to 15th Lok Sabha\n\n6 Aug. 2009\nMember, Committee on the Welfare of Scheduled Castes and Scheduled Tribes\n\n31 Aug. 2009\nMember, Committee on Home Affairs\nMember, Consultative Committee, Ministry of Finance\n","Permanent Address":"\nSai Arpan Bunglow , Near Sai Shraddha Housing Society, Behind Saibaba Bhakta Niwas, At+Post- Shirdi,\nTal. Rahata, Distt. Ahmednagar, Maharashtra - 423109\nTels. (02423) 257644 09423786904 (M)\n\n\n\n","Father's Name":"Shri Rajaram Govind Wakchaure","Spouse's Name":"Smt. Saraswati Bhausaheb Wakchaure"}