{"Place of Birth":"Sundarawali, Distt. Bharatpur (Rajasthan)","Sports and Clubs":", Rotary Club, Jaipur","Social And Cultural Activities":"Took steps to make a casteless society, made special efforts to reduce differences in Jats and Jatavas and brought them on one platform; took special steps to preserve communal harmony.","No.of Daughters":"4","Mother's Name":"Smt. Sukhama","Party Name":"Indian National Congress(INC)","Profession":"Engineer Social Worker","Date of Marriage":"21 May 1956","Favourite Pastime and Recreation":"To read, understand and adopt guidelines of Holy-books in life, like Geeta, Ramayana, Mahabharata, Vedas; participates in disscussions about the importance of Holy books in day to day life; reading biographies of great political leaders like Mahatama Gandhi, Pt. Nehru, Sardar Vallabh Bhai Patel, Baba Sahib Dr. Ambedkar and Smt. Indira Gandhi and tried to follow their principles and guidlines in real life.","Literary Artistic & Scientific Accomplishments":"While working in Rajasthan P.H.E.D, on various posts from Assistant Engineer to Chief Engineer, adopted techniques to reduce water loss in pipelines, reduce fluoride and other health hazard salts from drinking water, adopted latest techniques to reduce electricity losses in different type and of electric motors and pumps, selected suitable pipes for different areas depending on water quality and resistivity of sub-soil.","Constituency":"Bharatpur (SC) (Rajasthan )","Special Interests":"Unemployment, solving all type of problems of SC, ST, OBC, Women and Child, poor and needy, youth and ex-armymen.","Date of Birth":"02 Jan 1947","Educational Qualifications":"B.E. (Mechanical) Educated at M.B.M. Engineering College, University of Jodhpur, Rajasthan","No. of Sons":"1","Other Information":"Took active part in development, social and religious activities and help to weaker sections of society belonging to all castes and religions.","Present Address":"\n27, Meena Bagh,\nNew Delhi - 110 001\nTel. 9013180075 (M)\n\n\n\n","Email Address :":"ratansinghmp@gmail.com","Name":"Singh,Shri Ratan","Marital Status":"Married","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4404.jpg","Positions Held":"\n2009\nElected to 15th Lok Sabha\n\n31 Aug. 2009\nMember, Committee on Health and Family Welfare\n\n23 Sep. 2009\nMember, Committee on Private Members` Bill and Resolutions\n","Permanent Address":"\n122, Krishna Nagar, Bharatpur\nRajasthan\nTelefax. (05644) 222804, 09414023566 (M)\n\n\n\n","Father's Name":"Shri Het Ram","Spouse's Name":"Smt. Premlata"}