{"Place of Birth":"Patna ( Bihar)","Social And Cultural Activities":"Greatly influenced by Loknayak Jaiprakash Narayan`s movement; associated with philanthropic organisations like (i)SAFA (Satrughan Sinha Fans` Association), PRAYAS and KOSHISH; campaigned for raising funds for `Homes for Blind` and appealed to the people of the country for donating their eyes after death; organised blood donation camps through SAFA; crusaded against drug addiction amongst youth by arranging anti-drugs and anti-tobbacco programmes in schools and colleges in different parts of country; Chairman, PRAYAS (since 2001); an organisation engaged in rehabilitating orphans and disadvantaged children, youth and women in Delhi, Bihar, Gujarat, Assam and at the Tsunami devasted areas of Anadaman and Nicobar Islands; Board of Directors, KOSHISH, an organisation committed to serving the deaf and dumb in Delhi; associated with Sanjay Gandhi Post-Graduate Institute of Medical Sciences, Lucknow; also produced socailly relevant film like `Bihari Babu` and `Kalka` which deal with anti-dowry and labour exploitation.","No.of Daughters":"1","Mother's Name":"Late Smt. Shyamadevi Sinha","Party Name":"Bharatiya Janata Party(BJP)","Profession":"Artist","Date of Marriage":"09 Jul 1980","Literary Artistic & Scientific Accomplishments":"Started career in Films in the year 1967-68; acted in over 225 Hindi feature films; in addition has worked in Punjabi, Gujarati, Bhojpuri, Bengali, Tamil and Telgu feature films. His play `Pati Patni Aur Main` has been liked and appreciated by all prominent citizens and common people.","Constituency":"Patna Sahib (Bihar )","Special Interests":"Upliftment of the poor and downtrodden people; social service.","Date of Birth":"15 Jul 1946","Educational Qualifications":"Graduate Educated at Patna Science College, Patna and Film & Television Institute of India, Pune, Maharashtra","No. of Sons":"2","Other Information":"Member, Indian Parliamentary Delegation at the 61st Session of the UN General Assembly; shared the dais with Mr. Frank Pallone of the US Congress on the occasion of the celebration of 50th Anniversary of India`s Independence organised by Indian Political Association of Central California (USA); Grand Marshall, India Independence day Parade, New York, Los Angeles and San Francisco (USA); State guest of Pakistan and personal guest of the late President Zia-Ul-Haq; (i) Golden Jubilee Mela, August, 1996 on the occasion of India`s independence Day, invited by Indian Association in North America and UK; (ii) Chief Guest, Session of the International Hindi Association, New Jersey (USA), October, 1997; and (iii)Guest of Honour, Silver Jubilee Celebration, India Day Parade, Manahattan, New York (USA), August, 2005; (i) B.F.J.A. Award for best supporting actor in `Tanhai`; (ii) Punjab-Kala-Shree Award as Best Actor for film `Khudgarz`; (iii) Golden Semurg Award, Tashkent, 1988 for the film `Antorjoli Jatra`; (iv) All India Filmgoers award`Abhinaya Samrat`;(v)`Rashtriya Kishore Kumar Samman` by Madya Pradesh Government; (vi) name entered in the Limca Book of the Record,as the first actor from the Hindi Mainstream Cinema to become a Cabinet Minister in Govt. of India; (vii) Bihar Ratna for philanthropic activities; (viii) Award of Honour, New York (USA) and Toronto (Canada)for contribution to the Indian Cinema; and (ix)Certificate of Recognition by the Presiding Officer of Nasau County Legislature in recognition of his outstanding charitable work as Member of Parliament","Present Address":"\n10, Talkatora Road,\nNew Delhi - 110 001\nTel. (011) 23356264, 23356265, 9811962003 (M) Fax. (011) 23720731\n\n\n\n","Email Address :":"(i)shatrugn@sansad.nic.in (ii)shatrughansinha@ymail.com","Name":"Sinha,Shri Shatrughan Prasad","Marital Status":"Married","Countries Visited":"Australia, Canada, Mauritius, New Zealand, Pakistan, Saudi Arabia, South America and U.K.","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4468.jpg","Positions Held":"\n1996\nMember, Rajya Sabha\n\n2002\nRe-elected to Rajya Sabha (2nd term)\n\nJan 2003-May 2004\nUnion Cabinet Minister, Health and Family Welfare\n\nAug. 2004\nUnion Cabinet Minister, Shipping\n\n2009\nElected to 15th Lok Sabha\n\n31 Aug. 2009\nMember, Committee on Transport, Tourism and Culture\n","Permanent Address":"\n49, Ramayan, 9th Road, JVPD Scheme,\nJuhu, Mumbai - 400 049 Maharashtra\nTels. (022) 26008131, 26008132 Fax. (022) 26000999\n\n\n\n","Father's Name":"Late Shri B.P. Sinha","Spouse's Name":"Smt. Poonam Sinha"}