{"Place of Birth":"Pomia, Distt. Murshidabad (West Bengal)","Sports and Clubs":"Participated and represented college football and cricket teams; sports like sprint, long jump and high jump; free hand exercises and walking","Social And Cultural Activities":"(i)Recitation; (ii) mass songs; (iii) participation in plays as actor; (iv)speech on socio-political-cultural issues and on life, works of renaissance personalities, freedom fighters, medical scientists; and (v)organised and participated in language, health and education movements","Mother's Name":"Smt. Bimala Mandal","Party Name":"Independent(Ind.)","Profession":"Medical Practitioner Social Worker Educationist Cultural activist","Date of Marriage":"10 Jul 1999","Favourite Pastime and Recreation":"Medical social work to provide free medical services, especially at times of disaster for distressed and deprived people, watch good games\/sports items, good films, dramas,listening music\/songs and study literature, history and journals and `adda` with close friends","Literary Artistic & Scientific Accomplishments":"Written articles on (i)educational and cultural problems; (ii) public health awareness; (iii) diseases; (iv) disaster management program related to health hazards; (v)problems of health care delivery system of India; and (vi)poetry published in journals","Constituency":"Jaynagar (SC) (West Bengal )","Special Interests":"(i) Eradication of poverty, illiteracy, ill health, food crisis, housing problems, drinking water crisis of Indian population; (ii)facilitate people`s movement towards change over of present society to a exploitation free socialist society; and (iii) study literature of Shibdas Ghosh, founder of Socialist Unity Centre of India (SUCI) and Marxian classics","Date of Birth":"20 Jan 1959","Educational Qualifications":"M.B.B.S., P.G.C.C.H.M. Educated at Medical College, Calcutta University and National Institute of Health & Family Welfare, New Delhi","Other Information":"Voluntarily retired from the post of Chief Medical Officer (Selection Grade), ISPH, Nashik in july 2007;Participated in (i) disaster management works such as rendering free medical services as member and leader of Medical Service Centre, a socio-medical voluntary organisation functioning at different places for the last 32 years namely West Bengal floods, Assam floods, Supercyclone Orissa, Kosi flood Bihar, Mumbai flood (2005), Baroda and Surat floods (2005-06), Tsunami, Andaman Nicobar Islands, Earthquake, Gujrat, Aila Cyclone, Sunderbans, West Bengal, Kolkata and Mumbai slums: (ii) Health movements organised for improvement of medical education, health care delivery system of West Bengal and India; (iii)participated in the people`s resistance movement of Singur and Nandigram against land grabbing; and (iv) working for protection and upliftment of medical ethics and for pro-people scientific health policies;","Present Address":"\n72, North Avenue,\nNew Delhi - 110 001\nTels. (011) 23093658, 9013180170 (M) Fax. (011) 23093698\n\n\n\n","Email Address :":"(i) tarun.mandal@sansad.nic.in (ii) tkmandalisp@rediffmail.com","Name":"Mandal,Dr. Tarun","Marital Status":"Married","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4491.jpg","Positions Held":"\n2009\nElected to 15th Lok Sabha\n\n31 Aug. 2009\nMember, Standing Committee on Health and Family Welfare\nMember, Consultative Committee, Ministry of Rural Development & Panchayati Raj\nCo-Chairman, Vigilance and Monitoring Committee, South 24 PGS Distt. West Bengal\n","Permanent Address":"\n22\/1\/3, Lakshi Narayan Tala Road, Botanical Gardens\nHowrah - 711 103 West Bengal\nTels. (033) 26684184, 26687597, 9434097888 (M) Fax. (033) 26685451\n\n\n\n","Father's Name":"Late Kalidas Mandal","Spouse's Name":"Dr. Mahuya Nanda"}