{"Place of Birth":"Narayan Khed, Medak (Andhra Pradesh)","Sports and Clubs":"Member, Nizam Club and Country Club (Hyderabad)","Social And Cultural Activities":"(i) As a social worker, spread awareness is being created against child marriages; and (ii) Keen follower of music and traditional dances like Kuchipuddi and Bharatanatayam, etc.","No.of Daughters":"2","Mother's Name":"Smt. Chandramma Shetkar","Party Name":"Indian National Congress(INC)","Profession":"Agriculturist Social Worker","Date of Marriage":"20 May 1986","Favourite Pastime and Recreation":"(i) Reading of newspapers and political magazines; (ii) Watching T.V. like Discovery Channel, which covers animal life and history channel; and (iii) Visiting tourism spots and heritage structure.","Literary Artistic & Scientific Accomplishments":"Field experiments were conducted on usage of Drip Irrigation on sugarcane and found around 30% increase of quality yield in sugarcane.","Constituency":"Zahirabad (Andhra Pradesh )","Special Interests":"(i) Likes touring to the places of historic importance and heritage structures; and (ii) interested in educational tours to acquire innovative techniques.","Date of Birth":"08 Aug 1960","Educational Qualifications":"B.Sc. (Agriculture) Educated at Marathwada Agricultural University Parbhani,Maharashtra","No. of Sons":"1","Other Information":"(i) Hails from a popular freedom fighters family from Narayankhed of Distt. Medak, A.P.; (ii) My late grand father Sri Apparao Shetkar, a famous freedom fighter elected twice to A.P. Legislative Assembly from Narayankhed Assembly Segment; (iii) My father late Shri Shivrao Shetkar another popular freedom fighter and eminent advocate got elected thrice as MLA from same segment as IInd generation and it is privileged that I have been elected as IIIrd generation M.L.A. in the year 2004 from the same segment; (iv) Served Medak Distt. Youth Congress President from 1991-1998; (v) Also served as President Medak Distt. Congress Committee from 2002-2008; and (vi) Member, Board of Management to A.N.G.R.A.U. from 2006 till date.","Present Address":"\n24, Meena Bagh\nNew Delhi\nTels. (011) 23062902, 9013180082(M)\n\n\n\n","Name":"Shetkar,Shri Suresh Kumar","Marital Status":"Married","Countries Visited":"USA, Australia, China, France, Malaysia, Netherlands, Newzealand and Phillipines.","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4523.jpg","Positions Held":"\n1991-98 and 2002-2008\nPresident, Medak Distt. Congress Committee\n\n2004-2009\nMember, Andhra Pradesh Legislative Assembly\n\n2009\nElected to 15th Lok Sabha\n\n31 Aug. 2009\nMember, Committee on Chemicals and Fertilizers\n","Permanent Address":"\nOpposite Rammandir, Narayankhed, Distt. Medak-502286\nAndhra Pradesh\nTels. (08456) 283188, 09440859084 (M)\n\n\n\n","Father's Name":"Shri Shivrao Shetkar","Spouse's Name":"Smt. Uma Shetkar"}