{"Place of Birth":"Vill.Mapram,Malappuram(Kerala)","No.of Daughters":"1","Mother's Name":"Smt. Fathima","Party Name":"Indian Union Muslim League (IUML)","Profession":"Political and Social Worker","Favourite Pastime and Recreation":"Reading and listening to music","Constituency":"Ponnani (Kerala )","Date of Birth":"01 Jul 1946","Educational Qualifications":"Higher Secondary","No. of Sons":"3","Other Information":"(i) Central Advisory Board of Education (CABE); (ii) Government of India Committee on Decentralisation of Education Management; (iii) Janardhana Reddy Commission on National Educational Policy; and (iv) Minority Education Monitoring Committee; represented Kerala in the World Malayalee Conference, Berlin, Germany; - Introduction of Grading System at the Secondary and Higher Secondary level, which acclaimed national prominance; brought out the concept of self financing educational institution; establishment of Kannur University, Sri Sankara University of Sanskrit, Kaladi & National University of advanced legal studies at Kochi; comprehensive expansion of IT enabled education and the inclusion of IT as a part of curriculum in secondary level; implemented special package for the education and social upliftment of the physically and mentally handicapped children; and organised Global Education Meet at Cochin in 2005 as part of internationalisation of Education Awards (i) Silver Elephant Award from the President of India for the noble service rendered to Bharat Scouts and Guides Movement; (ii) Karma Sresta Award for the best Minister; (iii) Sir Sayed Award for the service rendered to the upliftment of backward and minority education; (iv) Seethi Sahib Award for the best Parliamentarian; (v) Award by Kerala Assembly for best short story;(vi) Award by Kerala Sasthra Vedi for promoting Science and Technology initiatives among the youth; and (vii) Special Award by anti-narcotic Council of India for the effective implementation of anti-narcotic and drug abuse laws in educational institutions","Present Address":"\nB-601, M.S. Flats,\nB.K.S. Marg, New Delhi - 110 001\nTels. (011) 23752428 09013180206, 09447125278 (M)\n\n\n\n","Email Address :":"(i) basheeret@gmail.com (ii) basheer.et@sansad.nic.in","Name":"Basheer,Shri E. T. Mohammed","Marital Status":"Married","Countries Visited":"Widely travelled","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4561.jpg","Positions Held":"\n1985 and 1991-06\nMember, Kerala Legislative Assembly(four terms)\n\n1991-1996 & 2004-2006\nMinister, Education, Government of Kerala\n\n1996-2001\nMember, Public Accounts Committee of Kerala Legislature\n\n2001-2004\nChairman, Estimates Committee of Kerala Legislature\nMember Kerala Agricultural University, Governing Council representing Kerala Legislature\nMember, Persons with Disabilities Act; Monitoring Committee representing Kerala Legislature\n\n2006\nSecretary, Indian Muslim League Kerala State Committee\nMember, Political Affairs Committee of Indian Union Muslim League\n\n2009\nElected to 15th Lok Sabha\n\n31 Aug. 2009\nMember, Committee on Social Justice and Empowerment\n\n23 Sep. 2009\nMember, Committee on Petitions\n","Permanent Address":"\nP.O. Soumyam, Cheruvayoor,\nMalappuram Distt.- 673 645 Kerala\nTel. (0483) 2725278\n\n\n\n","Father's Name":"Shri E.T. Moosakkutty","Spouse's Name":"Smt. Rukkiya Basheer"}