{"Place of Birth":"Idukki (Kerala)","Social And Cultural Activities":", Akhila Kerala Balajana Sakhyam (under Malayala Manorama); , Samskruthi, a cultural organization;, C.P. Sreedharan Smaraka Trust; , Kerala State Library Council; Former Member, National Youth Advisory Board under Department of Youth Affairs and Sport; and , Indian Team for the International Youth Festival, Venice, 1989","Mother's Name":"Late Smt. Annamma Thomas","Party Name":"Indian National Congress(INC)","Profession":"Political and Social Worker Advocate","Constituency":"Idukki (Kerala )","Date of Birth":"12 Dec 1950","Educational Qualifications":"M.A. (History), LL.B. Educated at Mar Ivanios College Thiruvananthapuram; Newman College, Thodupuzha, Idukki; Maharajas College Ernakulam; Government Law College, Kozhikode; and Government Law College, Ernakulam, Kerala","No. of Sons":"2","Other Information":"in mass agitation as a secondary school student for the constitution of Idukki district and arrested for picketing Village Office Konnathady, Idukki, Kerala;, Kerala Students Union Unit Committee, Mar Ivanios College, Thiruvananthapuram during the period of Pre Degree Course and the General Secretary, College Union; Idukki District President, Kerala Students Union; University Union Councillor, State general Secretary and State President, Kerala Students Union; Senate Member, Unitersity of Kerala; and worked as the front-runner for the construction of a tomb and monument for the tribal partriarch Kolumban who was the guide for the exploration of the site for Idukki Arch Dam; Winner (i) C.P. Sreedharan for best MLA, constituted by Veekshanam Readers Forum Abudabi; (ii) C.M. Stephen Cultural Forum Kuwait, 2005 for outstanding performance as MLA; and (iii) V.K. Gopoinathan Master Memento constituted by Thrippayar Welfare Society Thrissur for models in social cultural political works; Practiced as an Advocate in the High Court of Kerala; Member, Adhoc committee studied Kerala river waters agreement with neighbouring States (especially Mullapperiyar and Parambikkulam)","Present Address":"\n34, South Avenue,\nNew Delhi - 110 011\nTels. (011) 23010594, 9013180092 (M)\n\n\n\n","Email Address :":"ptthomasidk@gmail.com","Name":"Thomas,Shri P. T.","Marital Status":"Married","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/4565.jpg","Positions Held":"Kerala State General Secretary, Indian Youth Congress\n\n1980\nMember, Kerala Pradesh Congress Committee\nMember, All India Congress Committee\nExecutive Committee Member, Kerala Pradesh Congress Committee\n\n1990\nMember, Idukki District Council\n\n1991-2001\nMember, Kerala Legislative Assembly (two terms)\n\nFeb. 2007\nPresident, District Congress Committee\n\n2009\nElected to 15th Lok Sabha\n\n31 Aug. 2009\nMember, Committee on Personnel, Public Grievances, Law and Justice\n","Permanent Address":"\nPuthiyaparambil, Upputhode, Rajamudi-685604\nDistt. Idukki, Kerala\nTels.(04862) 229595, 09447029595 (M)\n\n\n\n","Father's Name":"Late Shri Thomas Puthiyaparambil","Spouse's Name":"Smt. Uma Thomas"}