{"Place of Birth":"Nathdwra (Rajasthan)","Sports and Clubs":"Walking, jogging and cycling","Social And Cultural Activities":"As the Chairperson, National Commission of Women: Initiated the process works relating to following Bills\/amendments to the existing ones, (i) Scheme for Relief and Rehabilitation for Victims of Rape, 2005; (ii) Compulsory Registration fo Marriages Bill, 2005; (iii) the Domestic Violence Act, 2005; (iv)Amendments to the laws relating to rape and related provisions; (v)The Sexual Harassment of Women at Work Place (Prevention, Prohibition and Redressal) Bill, 2006; (vi) Review of Section 125 of Code of Criminal Procedure:Order for maintenance of wives, children and parents; (vii)Older Persons (Maintenance, Care and Protection)Bill, 2005; (viii) Review of the Dowry Prohibition Act, 1961;(ix)Implementation of the Pre-Conception and Pre-Natal Diagnostic Test Act (PC & PNDT); (x) Offences by Acids (Prevention and Regulation)Act, 2007; (xi) Draft Bill on regulation and registration of Domestic WOrkers, 2007; (xii) Publication of Booklet titled `Meera Didi Se Poocho`: (xiii) Draft National Policy for women in Agricultural Sector, 2007; (xiv) Bill on Reservation for Women in the Parliament and State Legislative Assemblies; (xv)The National Commission for Women Act, 2006 so as to increase the powers of the Commission and to consider a separate investigation team to enquire into the complaints;(xi)Minimum age for emigration clearance to women as housemaids\/domestic workers in Gulf countries and other foreign countries\/suggestions on amendments to emigration act; (xvii) Amendment in laws relating to Adultery (section 497 of IPC); (xviii) Prepared Report on Problems Relating to NRI Marriages; (xix) National Consultation on Mental Health;(xx)Workshop on Integrated Plan of Action to Prevent and Combat Human Trafficking with Special Focus on Childrean and Women; (xxi)Commission`s views on section 498A IPC; (xxii) Issues relating to the heinous crime to throwing acid on women including their rehabilitation and other aspects; (xxiii) Working and Safety concerns of Women in Call Centres\/BPO industry and prescribed NCW`s Guidelines to be followed by BPO units","Mother's Name":"Smt. Jamuna Devi Vyas","Party Name":"Indian National Congress(INC)","Profession":"Professor Women Social Activist","Favourite Pastime and Recreation":"Music, Reading and writing Urdu ghazals and Hindi poems.","Constituency":"Chittorgarh (Rajasthan )","Special Interests":"Study and writing of ghazals and poems; development of backward areas of Rajasthan, working for poor people as well as SCs, STs and minorities; working for women, widows and children; and unity and integrity of the country","Date of Birth":"08 Jul 1946","Educational Qualifications":"M.A.(Philosophy), Ph.D. Educated at University of Udaipur and U.S.A.","Other Information":"Represented India: (i) 5th Asian Women Parliamentarians and Ministers Conference at Beijing, China, November, 2007; (ii) Regional Policy Dialogue Org., Asian Pacific resource and research Centre for Women (ARROW) to address the Women empowerment and upliftment issues in Bangkok,Thailand, May, 2006; (iii) 49th and 50th Session of the UN Commission on the Status of Women in New York, March,2005 and 2006; and (iv) Beijing Plus Ten-5th South Asia reginal Conference organised by the UNIFEM, Islamabad, Pakistan; Attended (i)10th Indo-European Union Round Table meeting organised by Ministry of External Affairs (Govt. of India), Vienna, June 2006;and (ii)United Nation General Assembly meeting, New York, October, 2009 Academic activities: Head, Department of Philosophy; Associate Professor, Univeristy of Udaipur; Professor,Univeristy of Udaipur; Taught (i)University of Deleware, USA, 1989-90; and (ii) Summer in Spain -1980; Paper selected and read in the Canada International Neoplatonic Society, October, 1977; All India UGC Fellowship 1967-69; Awarded Gold Medal for securing Ist position in (i) M.Phil in the University, 1967 (ii) M.Phil in all faculties; and (iii) Faculty of Humanities respectively. Ph.D in Philosophy (Dissertation on a Comparative Study of Ethical Teachings in Gita and Bible(1973)). Received Post Doctoral Fellowship at University of Deleware, US from 1979-80","Present Address":"\nAB-96, Shahjahan Road,\nNew Delhi - 110 011\nTels. (011) 23061928, 23061242 (O) 23782273 (R), 9414055540 (M) Fax. (011) 23061780 (O) 23782364 (R)\n\n\n\n","Email Address :":"girijav@sansad.nic.in","Name":"Vyas,Dr.(Kum.) Girija","Marital Status":"Unmarried","Countries Visited":"Widely travelled","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/517.jpg","Positions Held":"\n1977-84\nPresident, District Congress Committee [D.C.C. (I)], Udaipur\n\n1985-90\nMember, Rajasthan Legislative Assembly\n\n1986-90\nMinister of State, Tourism, PWD, Child & Nutrition, Public Relations, Education, Parliamentary Affairs, Finance and Taxation, Science & Technology, Technical Education, Dairy and Animal Husbandry etc. ,Govt. of Rajasthan,\nMember, Estimates Committee, Rajasthan Legislative Assembly\n\n1989\nExecutive Member, Pradesh Congress Committee [P.C.C. (I)], Rajasthan\n\n1990 - onwards\nMember, All India Congress Committee (A.I.C.C.)\n\nJun. 1990-93\nPresident, Pradesh Mahila Congress, Rajasthan\n\n1991\nElected to 10th Lok Sabha\n\nJun. 1991 to Jan. 1993\nUnion Deputy Minister, Information and Broadcasting\n\n1993-96\nMember, Standing Committee on Home and External Affairs\n\n1993 onwards\nPresident, All India Mahila Congress\n\n1993-96\nMember, Consultative Committee, Ministry of Petroleum and Natural Gas\n\n1996\nRe-elected to 11th Lok Sabha (2nd term)\n\n1996\nMember, Committee on Raj Bhasha\nMember, Committee on Empowerment of Women\nMember, Standing Committee on Petroleum\nMember, Consultative Committee, Ministry of Home Affairs\n\n1999\nRe-elected to 13th Lok Sabha (3rd term)\n\n1999-2004\nMember, Consultative Committee, Ministry of Petroleum and Chemicals\n\n2000-2004\nMember, Consultative Committee, Ministry of Petroleum and Natural Gas\nPresident, Pradesh Congress Committee (P.C.C.), Rajasthan\n\n2005-08, 2008-11\nChairperson, National Commission for Women\n\n2009\nRe-elected to 15th Lok Sabha (4th term)\n\n29 Jun. 2009\nMember, Business Advisory Committee\n\nJun. 2009\nMember, Panel of Chairmen\n\n31 Aug. 2009\nMember, Committee on Railways\nMember, Consultative Committee, Ministry of Health\n\n23 Sep. 2009\nMember, Committee of Privileges\nMember, National Integration Council\n\n19 Oct. 2009\nMember, General Purpose Committee\n\n15 Mar. 2010\nMember, Railway Convention Committee\n\n17 Jun. 2013 onwards\nUnion Cabinet Minister, Housing and Urban Poverty Alleviation\n","Permanent Address":"\n21-H, Daitya Nagri,\nUdaipur Rajasthan\nTel. (0294) 2525356\n\n\n\n","Father's Name":"Shri Krishna Sharma"}