{"Place of Birth":"Goybari (Bijni), Distt. Goalpara*, Assam","Sports and Clubs":"Football and badminton; actively involved in campaigning for the promotion of football and other indigenous tribal games and sports among the younger generation in the Bodo-tribal society; setting of Special Area Games Complex (SAGC) under SAI at Kathalguri, Kokrajhar","Social And Cultural Activities":"Worked for socio-economic upliftment of the down-trodden Bodos and other tribes; worked actively to enforce prohibition and took up other social causes of the oppressed employees, labourers, farmers, women, children and landless people right since student days; worked for betterment of the Bodo society and creating social awareness among the indigenous Bodos of Assam; Founder, (i) All Assam Tribal Women’s Welfare Federation (AATWWF); (ii) All Bodo Samaj Durbar, 1990, which took up socio-economic issues and causes of Bodos; (iii) All Bodo Employees` Federation (ABEF); (iv) Dularai Bodo Harimu Afat (All Bodo Cultural Association\/Forum); (v) Erstwhile Bodo People`s Human Rights and Civil Liberties; and (vi) One of the Ideologue Founders of the All Bodo Farmers` Association formed in 2001 (DUBBA).","Mother's Name":"Late Smt. Ishari Bwiswmuthiary","Party Name":"Bodoland Peoples Front(BPF)","Profession":"Agriculturist Teacher Political and Social Worker","Date of Marriage":"18 Feb 1981","Favourite Pastime and Recreation":"Reading books on Ethno-Political, Socio-Cultural-linguistic and literary works and on the movements relating to the question of autonomy and political right to self-determination of the indigenous and tribal people across the globe; horticulture","Literary Artistic & Scientific Accomplishments":"Member, Central Working Committee, Bodo Sahitya Sabha, 1981-83; actively involved in persuading the Government headed by Late Shri Hiteswar Saikia to accord Associate Official Language Status to Bodo language in Assam in 1984-85 during tenure as the General-Secretary of the All Bodo Students’ Union; active in publication of Bodo Journals and Bodo Newspapers; played pioneering role in persuading the Government to take initiatives to include the Bodo language in the 8th Schedule of the Constitution of India through the passage of the Constitution (One-Hundredth Amendment) Bill, 2003 on 22 December, 2003 and also to create present day Bodoland Territorial Areas District (BTAD) and Bodoland Territorial Council in Assam in 2003 in pursuance of the New Bodo Accord signed between the Union Government , the State Government of Assam and the Bodo Liberation Tigers (BLT) on 10 February, 2003.","Constituency":"Kokrajhar (ST) (Assam )","Special Interests":"Preservation of Bodo cultural heritage including music, dance, theatre, customs,tradition, Bodo costumes and attires; actively persuading the concerned Government authorities to take steps for improvement of technology and to patronize the export of the Bodos` Eri and Muga based handloom products","Date of Birth":"01 Jan 1960","Educational Qualifications":"B.A. (Hons. in Political Science), Prabin (Hindi) Educated at Kokrajhar College,Kokrajhar, Guwahati University and the Asom Rashtra Bhasha Prachar Samiti, Guwahati, Assam","No. of Sons":"4","Other Information":", All Bodo Students’ Union; and the , Bodo People’s Action Committee; launched the movement for attaining Statehood for Bodoland within the Indian Union through peaceful and democratic means and struggled consistently to ensure the survival and existence of indigenous Bodo people with their distinct ethnic identity; led the Bodoland movement as President of All Bodo Students Union (ABSU) from 1990-93 and signed the Bodo Accord on 20 February 1993; , erstwhile Bodoland People’s Party (B.P.P.) and Bodoland Statehood Movement Council (B.S.M.C.) respectively between 1993 and 1998; committed to the cause of assertion of rights of aboriginal Bodos and Tribals as a whole; mobilised the indigenous Bodos of the World particularly living in the Indian sub-continent, Bangladesh, Canada, Nepal, U.K. and U.S.A. and got them united under the Forum, ‘World Bodo National Conference Durbar’ and represented them in the capacity of its President at the 17th Session of the United Nations Working Group on Indigenous and Tribal People (UNWGIP), Geneva, Switzerland, 1999; also worked as Human Rights and Peace-Mission Activist, quit the post of the Chief of the Bodoland Autonomous Council on 16th November, 1993 and actively participated in reviving the demand for a separate state (Bodoland) and renewed the struggle for the attainment thereof following the failure of the First Bodo Accord, played pivotal role in persuading both the Government of India and the Government of Assam to start dialogue with the Bodo Liberation Tigers (BLT) to bring about political solution to the long pending Bodoland and other genuine Bodo issues including inter alia the inclusion of Bodo Language in the 8th Schedule of the Constitution which ultimately resulted in the signing of the `Second Bodo Accord` between the Union Government, Government of Assam and the Bodo Liberation Tigers (BLT) on 10 February, 2003 culminating in the formation of the `Bodoland Territorial Areas District and its administrative set up-Bodoland Territorial Council` under the provision of the Sixth Schedule to the Constitution","Present Address":"\n7, Ferozeshah Road,\nNew Delhi - 110 001\nTels. (011) 23782979, 09868180649 (M) Fax. (011) 23782406\n\n\n\n","Email Address :":"sansuma.kb@sansad.nic.in sansuma.kb@gmail.com","Name":"Bwiswmuthiary,Shri Sansuma Khunggur","Marital Status":"Married","Countries Visited":"Australia, Bhutan, Canada, China, Germany, Mongolia, Nepal, South Korea, Switzerland, Thailand, United Kingdom and U.S.A. Participated in (i) the 53rd Session of the UN General Assembly in New York in 1998 as a member of the non-official delegation; (ii) the International Conference of the UN Working Group on the Indigenous and Tribal People held in Geneva in 1999; (iii) the International Workshop on `Innovative Urban Management` in Sydney and Bangkok; and (iv) joined the contigent of Air India headed by the then Union Minister of Civil Aviation Syed Shahnawaz Hussain on the occasion of Air India`s to and fro Inaugural Flight on Guwahati-Bangkok International Sector`; (v)participated in the 60th Session of UN General Assembly, New York, USA, October, 2005; (vi) 2nd World Assembly, Seoul, South Korea, 30 Nov.- 3 Dec 2004 under the auspices of the Mongolian Peoples` Federation for World Peace, and the Inter-religious and International Federation for World Peace;(vii) International Conference of the Mongoloid Peoples`, Ulan Bator, Mongolia, August, 2006 on the auspicious occasion of the celebration of 800th Year of Mongolia state, 1st January-31 December, 2006; (viii) joined Indian Parliamentary delegation on `Goodwill Misson to the USA`headed by Shri Vayalar Ravi, the then and the present Union Minister of Overseas Indian Affairs, September 2008; (ix) World Bamboo Congress Conference`, Bangkok, Thailand,September, 2009; (x) 121 Assembly of IPU, Geneva (Switzerland), October, 2009; (xi) International Network of Bamboo and Rattan, Shanghai (China), June, 2010","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/66.jpg","Positions Held":"\n\n1993\nChief, erstwhile Bodoland Autonomous Council, Assam (having State Cabinet Minister status) (which has subsequently become present day Bodoland Territorial Council)\n\n1998\nElected to 12th Lok Sabha\n\n1998-99\nMember, Committee on Home Affairs\nMember, Committee on the Welfare of the Scheduled Castes and Scheduled Tribes\n\n1999\nRe-elected to 13th Lok Sabha (2nd term)\n\n1999-2000\nMember, Committee on Home Affairs\n\n1999-2001\nMember, Committee on the Welfare of Scheduled Castes and Scheduled Tribes\n\n2000-2004\nMember, Consultative Committee, Ministry of Home Affairs\n\n2004\nRe-elected to 14th Lok Sabha (3rd term)\nMember, Committee on Home Affairs\nMember, Committee on the Welfare of Scheduled Castes and Scheduled Tribes Member, Consultative Committee, Ministry of Development of North Eastern Region\n\n2004-2009\nMember, Committee on Industy\n\n2009\nRe-elected to 15th Lok Sabha (4th term)\nLeader, Bodoland Peoples Front Parliamentary Party, Lok Sabha\n\n6 Aug. 2009\nMember, Committee on the Welfare of Scheduled Castes and Scheduled Tribes\n\n31 Aug. 2009\nMember, Committee on Energy\n\n1 May 2010\nMember, Committee on the Welfare of Scheduled Castes and Scheduled Tribes\nMember, Consultative Committee, Ministry of DONER and Mines\n","Permanent Address":"\nVill. Kathalguri, P.O. Haloadal,\nDistt. Kokrajhar, Bodoland -783 374 Assam\nTelefax. (03661) 270760\n\n\n\n","Father's Name":"Late Shri Bwrai Mahajwn Bwiswmuthiary","Spouse's Name":"Smt. Uttara Bwiswmuthiary"}