{"Place of Birth":"Panchur, Distt. Pauri Garhwal (Uttarakhand)","Sports and Clubs":"Badmintion and swimming.","Social And Cultural Activities":"Providing hostel for socially and economically weaker and backward children; working for mass-awakening against religious and social conventions, evils; running more than two dozens educational institutions and working for extending health facilities to rural areas","Party Name":"Bharatiya Janata Party(BJP)","Profession":"Religious Missionary Social Worker","Favourite Pastime and Recreation":"Gardening, religious discourses, bhajans and touring religious spots","Literary Artistic & Scientific Accomplishments":"Chief Editor, `Hindi weekly` and monthly magazine `Yogvani`","Constituency":"Gorakhpur (Uttar Pradesh )","Special Interests":"Campaigning for cow-protection and promotion; Rashtra Raksha Abhiyan for social and national security","Date of Birth":"05 Jun 1972","Educational Qualifications":"B.Sc. Educated at H.N.B. Garhwal University, Srinagar, Uttarakhand","Other Information":"(i) Vishwa Hindu Maha Sangh, Bharat (ii)Gau Raksha Samiti, Bharat (iii) Digvijaynath Swadhyay Kendra evam Vichar Manch, Gorakhpur (iv) Kisan Intermediate College, Bargoniya, Deoria (v) Hindi Saptahik Samachar Patra, Gorakhpur;Mahant Mahendra Nath Smarak Charitable Chikitsalay, Devi Patan, Tulsipur (Uttar Pradesh);(i) Guru Shri Gorakhnath Chikitsalay, Gorakhnath Mandir, Gorakhpur (ii) Maharana Pratap Mahavidyalaya, Jungle Ghusan, Gorakhpur (iii) Maharana Pratap Mahila Mahavidyalay, Ramduttapur, Gorakhpur (iv)Digvijaynath Balika Inter College, Chowk Bazar, Maharajganj (v) Maharana Pratap Krishak Inter College, Jungle Ghusan, Gorakhpur (vi) Mahant Digvijaynath Inter College, Chowk Bazar, Maharajganj (vii) Maharana Pratap Senior Secondary School, Betiyahata, Gorakhpur (viii) Piteswarnath Junior High School, Bharohiya, Pipiganj, Gorakhpur (ix) Gorakhnath Sanskrit Uchatar Madhymik Vidyalay, Gorakhnath, Gorakhpur (x) Mahayogi Guru Gorakhnath Yog Sansthan, Gorakhnath, Gorakhpur; (i) Maharana Pratap Shiksha Parishad, Gorakhpur; (ii) Digvijaynath Post Graduate College, Gorakhpur; and (iii) Maharana Pratap Inter College, Gorakhpur (iv) Maharana Pratap Balika Vidhyalay, Ramduttpur, Gorakhpur (v) Digvijaynath High School, Chawk mafi, Pipiganj, Gorakhpur (vi) Shri Gorakshnath Sanskrit Vidyapeeth, Gorakhpur (vii) Maharana Pratap Balika Vidyalaya, Civil Lines, Gorakhpur (viii) Maharana Pratap Junior High school, Gorakhpur; Banaras Hindu University & Aligarh Muslim University, 2004-2007.","Present Address":"\n123-125, North Avenue,\nNew Delhi - 110 001\nTels.(011) 23092633, 9868180061(M)\n\n\n\n","Email Address :":"(i) yogi.adityanath@sansad.nic.in(ii) yogiadityanath72@gmail.com","Name":"Adityanath ,Shri Yogi","Marital Status":"Unmarried","Countries Visited":"Combodia, Malaysia, Nepal, Singapore,Thailand and U.S.A.","Image":"http:\/\/164.100.47.132\/mpimage\/photo\/7.jpg","Positions Held":"\n1998\nElected to 12th Lok Sabha\n\n1998-99\nMember, Committee on Food, Civil Supplies and Public Distribution and its Sub-Committee-B on Department of Sugar and Edible Oils\nMember, Consultative Committee, Ministry of Home Affairs\n\n1999\nRe-elected to 13th Lok Sabha (2nd term)\n\n1999-2000\nMember, Committee on Food, Civil Supplies and Public Distribution\nMember, Consultative Committee, Ministry of Home Affairs\n\n2004\nRe-elected to 14th Lok Sabha ( 3rd term)\nMember, Committee on Government Assurances\nMember, Committee on External Affairs\nMember, Consultative Committee, Ministry of Home Affairs\n\n2009\nRe-elected to 15th Lok Sabha (4th term)\n\n31 Aug. 2009\nMember, Committee on Transport, Tourism and Culture\n","Permanent Address":"\n361, Purana Gorakhpur, Shri Gorakhnath Mandir,\nGorakhpur - 273 001 Uttar Pradesh\nTels.(0551) 2255453, 09450966551(M) Fax (0551) 2255455\n\n\n\n","Father's Name":"Shri Mahant Avaidyanathji Maharaj"}